[
  {
    "department": "MATH",
    "course_number": "003",
    "title": "Developmental Mathematics",
    "description": "A review of Intermediate High School Algebra intended for students preparing for one of the credit bearing Fundamental Studies Math Courses. It is taught in special computer labs using a self-paced computer program. The curriculum will be geared toward the student's level of algebra skills and eventual goals. There is a special fee for the course that may be applied in addition to the regular tuition charge. Students should refer to the schedule of classes for details on fees as they apply to a particular semester. The course does not carry any credit toward any degree at the University. The course is repeatable. Topics will be chosen from exponents, polynomials, linear equations, quadratic equations as well as polynomial, rational, exponential and logarithm functions and elementary probability or statistics, depending on the student.\n<i>Students must pay a special math fee.</i>",
    "credits": 3,
    "professors": [
      "Jack Baker",
      "Santuria Orsetti",
      "Colleen Terpos",
      "Marguerite Jarchow",
      "Kimberly Bethea",
      "Lee Ann Lewis",
      "Eric Hamilton",
      "Kelly Watson",
      "Tiffany Moore",
      "Barbara Michelato",
      "Ingrid Brown-Scott",
      "Matthew Wilson",
      "Charles Daly",
      "Matt Wilson",
      "Jayna Resman",
      "Carlotta Amaduzzi",
      "David Russell",
      "Brandon Alexander"
    ],
    "average_gpa": null
  },
  {
    "department": "MATH",
    "course_number": "007",
    "title": "Algebra for MATH 107",
    "description": "A review of Intermediate High School Algebra intended for students preparing for MATH107. It is taught 5 days per week for the first 5 weeks, then leads directly into a special section of MATH107, the same semester, which also meets 5 days per week. Continuation in MATH107 is conditional on the student passing the MATHEMATICS PLACEMENT EXAM at the appropriate level. Topics include linear equations, linear inequalities, operations on polynomials, factoring, solutions of quadratic equations, as well as exponential and logarithm functions. MATH007 does not carry any credit toward any degree at the University, nor is it graded. It leads to either MATH107 or MATH003, both of which are graded.",
    "credits": 3,
    "professors": ["Arthur Bruckheim", "Debra Franklin"],
    "average_gpa": 2.89895
  },
  {
    "department": "MATH",
    "course_number": "010",
    "title": "Algebra for MATH 110",
    "description": "A review of Intermediate High School Algebra intended for students preparing for MATH110. It is taught 5 days per week for the first 5 weeks, then leads directly into a special section of MATH110, the same semester, which also meets 5 days per week. Continuation in MATH110 is conditional on the student passing the MATHEMATICS PLACEMENT EXAM at the appropriate level. Topics include linear equations, linear inequalities, operations on polynomials, factoring, solutions of quadratic equations, as well as exponential and logarithm functions. MATH010 does not carry any credit toward any degree at the University, nor is it graded. It leads to either MATH110 or MATH003, both of which are graded.",
    "credits": 3,
    "professors": ["Ben Bezejouh"],
    "average_gpa": 2.1219
  },
  {
    "department": "MATH",
    "course_number": "011",
    "title": "Algebra for MATH 111",
    "description": "A review of Intermediate High School Algebra intended for students preparing for MATH111. It is taught 5 days per week for the first 5 weeks, then leads directly into a special section of MATH111, the same semester, which also meets 5 days per week. Continuation in MATH 111 is conditional on the student passing the MATHEMATICS PLACEMENT EXAM at the appropriate level. Topics include exponents, polynomials, linear equations, quadratic equations, as well as polynomial, rational, exponential and logarithm functions, Venn diagrams, permutations and combinations. MATH011 does not carry any credit toward any degree at the University, nor is it graded. It leads directly to MATH111 (or MATH113 or MATH110), or MATH003, all of which are graded.",
    "credits": 3,
    "professors": ["Marguerite Jarchow", "Stephen Kcenich"],
    "average_gpa": 2.70588
  },
  {
    "department": "MATH",
    "course_number": "013",
    "title": "Algebra for MATH 113",
    "description": "A review of Intermediate High School Algebra intended for students preparing for MATH113. It is taught 5 days per week for the first 5 weeks, then leads directly into a special section of MATH113, the same semester, which also meets 5 days per week. Continuation in MATH113 is conditional on the student passing the MATHEMATICS PLACEMENT EXAM at the appropriate level. Topics include exponents, polynomials, linear equations, quadratic equations, as well as polynomial, rational, exponential, logarithm functions, and trigonometry. MATH013 does not carry any credit toward any degree at the University, nor is it graded. It leads directly to MATH113 (or MATH110), or MATH003, all of which are graded.",
    "credits": 3,
    "professors": [
      "Santuria Orsetti",
      "Debra Franklin",
      "Arthur Bruckheim",
      "Susan Mazzullo",
      "Barbara Michelato",
      "Jermain McDermott",
      "Morgan Bryant"
    ],
    "average_gpa": 2.21759
  },
  {
    "department": "MATH",
    "course_number": "015",
    "title": "Algebra for MATH 115",
    "description": "A review of Intermediate High School Algebra intended for students preparing for MATH115. It is taught 5 days per week for the first 5 weeks, then leads directly into a special section of MATH115, the same semester, which also meets 5 days per week. Continuation in MATH115 is conditional on the student passing the MATHEMATICS PLACEMENT EXAM at the appropriate level. Topics include exponents, polynomials, linear equations in one and two variables, quadratic equations, as well as polynomial, rational, exponential, logarithm functions and trigonometry. MATH015 does not carry any credit toward any degree at the University, nor is it graded. It leads directly to MATH115 (or MATH111 or MATH113 or MATH110), or MATH003, all of which are graded.",
    "credits": 3,
    "professors": [
      "Stephen Kcenich",
      "Ben Bezejouh",
      "Marguerite Jarchow",
      "Santuria Orsetti",
      "Arthur Bruckheim",
      "Kimberly Fouche",
      "Sean Ballentine",
      "Tessa Thorsen",
      "Danielle Middlebrooks",
      "Franck Olivier Ndjakou Njeunje"
    ],
    "average_gpa": 1.66959
  },
  {
    "department": "MATH",
    "course_number": "107",
    "title": "Introduction to Math Modeling and Probability",
    "description": "<b>Prerequisite:</b> Must have math eligibility of Math 107 or higher; and math eligibility is based on Math Placement Exam or successful completion of MATH003 with appropriate eligibility.\n<b>Restriction:</b> Not open to students majoring in mathematics, engineering, business, life sciences, and the physical sciences;; and must not have completed MATH120, MATH130, MATH136, or MATH140; and must not have completed MATH220; and must not have completed any MATH or STAT course with a prerequisite of MATH120, MATH130, MATH136, MATH140 or MATH220.\n<b>Credit only granted for:</b> STAT100, MATH107, MATH110, MATH111, MATH112, or MATH113.\n<b>Formerly:</b> Math 110 and Math 111.\n<b>Additional information:</b> Students who have credits for MATH107 may not also receive credits for STAT100, MATH110, MATH 111, MATH112, or MATH113.\nA goal is to convey the power of mathematics as shown by a variety of problems which can be modeled and solved by quantitative means.  Also included is an introduction to probability.  Topics include data analysis, equations, systems of equations, inequalities, elementary linear programming, Venn diagrams, counting, basic probability, permutations, combinations, tree diagrams, standard normal and normal distributions. The mathematics of finance is covered.  The course includes problem solving and decision making in economics, management, and social sciences.",
    "credits": 3,
    "professors": [
      "Jialin Li",
      "Julie Daberkow",
      "Laura Iosip",
      "William Schildknecht",
      "Arthur Bruckheim",
      "Debra Franklin",
      "Jonathan Inbal",
      "Yixin Ren",
      "Charles Daly",
      "Afrouz Rahmati",
      "Brooke Herzog",
      "Jinhang Xue",
      "Sarah Burnett",
      "Siddharth Sharma",
      "Matthew Dellatorre",
      "Mirna Pinsky",
      "Patrick Daniels",
      "Samuel Dipasqua",
      "Kyle Liss",
      "Victoria Whitley",
      "Christopher Dock",
      "Tong Qi",
      "Tessa Thorsen",
      "Michael Rozowski"
    ],
    "average_gpa": 2.36357
  },
  {
    "department": "MATH",
    "course_number": "110",
    "title": "Elementary Mathematical Models",
    "description": "Topics include simple and compound interest; recursion for computing balances; installment loans and amortization; approximating data by linear models; analysis of applications to real-world collections of data; probability; conditional probability; independence; expected value; graphing and analysis of systems of inequalities; linear programming and applications.",
    "credits": 3,
    "professors": [
      "Julie Daberkow",
      "Ke Xue",
      "Ben Bezejouh",
      "Eric Hamilton",
      "David Reynoso Valle",
      "Stephen Sorokanich",
      "Hsin-Yi Lin",
      "Guowei Sun",
      "Daniel Zollers",
      "Clarice Glowacki",
      "Patrick Daniels"
    ],
    "average_gpa": 2.29968
  },
  {
    "department": "MATH",
    "course_number": "111",
    "title": "Introduction to Probability",
    "description": "Logic, Boolean algebra, counting, probability, random variables, expectation, applications of the normal probability distribution.",
    "credits": 3,
    "professors": [
      "Eric Hamilton",
      "Jonathan Fernandes",
      "William Schildknecht",
      "Marguerite Jarchow",
      "Xuan Yao",
      "Matthew Becker",
      "Timothy Pilachowski",
      "Arseny Zakharov",
      "Timothy Mercure",
      "Ryan Kirk",
      "Stefan Poikonen",
      "Jinhang Xue",
      "Sahil Chopra",
      "Jesse Milzman",
      "Charles Daly",
      "Mark Magsino",
      "Micah Goldblum",
      "Lijuan Cao",
      "Stephen Kcenich",
      "Tianhui Zhang",
      "Andreas Roy",
      "Saida Zardi",
      "Nathaniel Monson",
      "Douglas Galagate",
      "Stephanie Young",
      "Minsung Kim",
      "Chen Dong",
      "Matthew Dellatorre"
    ],
    "average_gpa": 2.80129
  },
  {
    "department": "MATH",
    "course_number": "112",
    "title": null,
    "description": null,
    "credits": null,
    "professors": [
      "Bo Tian",
      "Adam Ross",
      "Siming He",
      "Stephanie Young",
      "Yue Tian",
      "Luyu Sun"
    ],
    "average_gpa": 2.17382
  },
  {
    "department": "MATH",
    "course_number": "113",
    "title": "College Algebra and Trigonometry",
    "description": "<b>Prerequisite:</b> Must have math eligibility of MATH113 or higher; and math eligibility is based on the Math Placement Exam or the successful completion of MATH 003 with appropriate eligibility.\n<b>Restriction:</b> Must not have completed MATH115, MATH120, MATH130, MATH136, or MATH140; and must not have completed any course with a prerequisite of MATH120, MATH130, MATH136, MATH140 or MATH220; and must not have completed MATH112 or MATH220.\n<b>Credit only granted for:</b> Students who have credits for MATH113 may not also receive credits for MATH107, MATH110, MATH112, or MATH115.\nTopics include elementary functions including graphs and applications of: polynomial, rational, exponential, and logarithmic functions. Systems of equations and applications. Trigonometric functions: angle and radian measure, graphs and applications.",
    "credits": 3,
    "professors": [
      "Jacqueline Stone",
      "Raluca Rosca",
      "Jonathan Cohen",
      "Santuria Orsetti",
      "Debra Franklin",
      "Maxx Cho",
      "Ke Xue",
      "Eric Hamilton",
      "Elif Kuz",
      "Matthew Becker",
      "Philip Wertheimer",
      "Terence Long",
      "Xuesen Na",
      "Arijit Sehanobish",
      "Stefan Poikonen",
      "Karen McLaren",
      "Sahil Chopra",
      "Kathryn Truman",
      "Mestiyage Gunatilleka",
      "Jian-Long Liu",
      "Laura Iosip",
      "Tao Zhang",
      "Shujie Kang",
      "Ryan Kirk",
      "Jonathan Huang",
      "Chenzhi Zhao",
      "Pratima Hebbar",
      "Jeremiah Emidih",
      "Graham Antoszewski",
      "David Reynoso Valle",
      "Kristin Carfora",
      "Steven Reich",
      "Corry Bedwell",
      "Franck Olivier Ndjakou Njeunje",
      "Yichun Zhu",
      "Anqi Ye",
      "Shuo Yang",
      "Mirna Pinsky",
      "S Gilles",
      "Jocelyn Menecio",
      "Jacob Ralston",
      "Ran Ji",
      "Gokhan Civan",
      "Karamatou Yacoubou Djima",
      "Hechao Sun",
      "Michael Kreisel",
      "Wei-Hsuan Yu",
      "Stephanie Young",
      "Madhura Joglekar",
      "Matthew Dellatorre",
      "Lucas Tcheuko",
      "Quan Bui",
      "Stephen Gilles",
      "Yiran Li",
      "Jianlong Liu",
      "Ioannis Markakis",
      "Levon Dovlatyan",
      "Adil Virani",
      "Jermain McDermott",
      "Brandon Alexander",
      "Christopher Dock",
      "Daochen Wang",
      "Darcy Conant",
      "Dolly Hall",
      "Ian Teixeira",
      "Kevin Dunlap",
      "Ramon Braza",
      "Arthur Bruckheim",
      "Charles Daly",
      "Shin Song",
      "Zachary Greenberg",
      "Brooke Herzog",
      "D"
    ],
    "average_gpa": 2.29228
  },
  {
    "department": "MATH",
    "course_number": "115",
    "title": "Precalculus",
    "description": "<b>Prerequisite:</b> Must have math eligibility of MATH115 or higher; and math eligibility is based on the Math Placement Exam or the successful completion of MATH003 with appropriate eligibility. Or MATH113.\n<b>Restriction:</b> Must not have completed MATH140; and must not have completed any MATH or STAT course with a prerequisite of MATH140.\n<b>Credit only granted for:</b> Students who have credits for MATH115 may not also receive credits for MATH112 or MATH113.\nPreparation for MATH120, MATH130 or MATH140. Elementary functions and graphs: polynomials, rational functions, exponential and logarithmic functions, trigonometric functions. Algebraic techniques preparatory for calculus.\n<i>Preparation for MATH 220 or MATH 140. All sections will require the use of a TI graphics calculator. Instructor will use a TI-83 or TI-83+ calculator. If purchasing used books additional software may be required.</i>",
    "credits": 3,
    "professors": [
      "Frances Gulick",
      "Kimberly Bethea",
      "Raluca Rosca",
      "Terence Long",
      "Marguerite Jarchow",
      "Jonathan Huang",
      "Ben Bezejouh",
      "Stephen Balady",
      "Christoforos Somarakis",
      "Arijit Sehanobish",
      "Alex Blumenthal",
      "Catherine VanNetta",
      "Kimberly Fouche",
      "Benjamin Lauser",
      "Roberto De Leo",
      "Santuria Orsetti",
      "Asia Wyatt",
      "Jocelyn Menecio",
      "Sean Gruber",
      "William Schildknecht",
      "Papia Bera",
      "Patrick Daniels",
      "Timothy Pilachowski",
      "Arthur Bruckheim",
      "Sean Ballentine",
      "Nakyung Lee",
      "Weikun Wang",
      "Danielle Middlebrooks",
      "Ramon Braza",
      "Jiaxin Yuan",
      "Melanka Wedige",
      "Jonathan Inbal"
    ],
    "average_gpa": 1.89884
  },
  {
    "department": "MATH",
    "course_number": "120",
    "title": "Elementary Calculus I",
    "description": "<b>Prerequisite:</b> 1 course with a minimum grade of C- from (MATH112, MATH113, MATH115). Or must have math eligibility of MATH120 or higher; and math eligibility is based on the Math Placement Test.\n<b>Restriction:</b> Not open to students majoring in mathematics, engineering, the biological sciences, biochemistry, chemistry, or the physical sciences.\n<b>Credit only granted for:</b> MATH120, MATH130, MATH136, MATH140, or MATH220.\n<b>Formerly:</b> MATH220.\nBasic ideas of differential and integral calculus, with emphasis on elementary techniques of differentiation and applications.",
    "credits": 3,
    "professors": [
      "Archana Khurana",
      "Hilaf Hasson",
      "Heyrim Cho",
      "Timothy Pilachowski",
      "Tobias von Petersdorff",
      "Sarah Yeakel",
      "Bradford Sanders",
      "Terence Long",
      "Scott Wolpert",
      "Daniel Kaufman",
      "Franck Olivier Ndjakou Njeunje",
      "Jeremiah Emidih",
      "Ben Bezejouh",
      "Lawrence Washington",
      "Samuel Bloom",
      "Pratima Hebbar",
      "Thibaut Castan",
      "Rufus Elemo",
      "Kendall Williams",
      "Mestiyage Gunatilleka",
      "Priyankur Chaudhuri",
      "Agnieszka Zelerowicz",
      "Jack Baker",
      "Ramon Braza",
      "Stefan Doboszczak",
      "Yordanka Kovacheva",
      "Adam Kanigowski",
      "Samuel Braunfeld",
      "Dani Kaufman",
      "Arghya Sadhukhan",
      "Melanka Wedige",
      "Eoin Mackall",
      "John Quah",
      "Shuhan Kou",
      "Haeyun Seo",
      "Raymond Schram",
      "Xiaoqi Huang"
    ],
    "average_gpa": 2.80234
  },
  {
    "department": "MATH",
    "course_number": "121",
    "title": "Elementary Calculus II",
    "description": "<b>Prerequisite:</b> MATH120, MATH130, MATH136, or MATH140; or must have completed MATH220.\n<b>Restriction:</b> Not open to students majoring in mathematics, engineering, the biological sciences, biochemistry, chemistry, or the physical sciences.\n<b>Credit only granted for:</b> MATH121, MATH131, MATH141, or MATH221.\n<b>Formerly:</b> MATH 221.\nDifferential and integral calculus, with emphasis on elementary techniques of integration and applications.",
    "credits": 3,
    "professors": [
      "Elif Kuz",
      "Yiming Lyu",
      "Jenny Rustad",
      "Jacob Renn",
      "Maxx Cho",
      "Haoran Li",
      "Ying Li",
      "Arghya Sadhukhan",
      "Kyle Liss",
      "Jermain McDermott",
      "Haeyun Seo"
    ],
    "average_gpa": 2.6083
  },
  {
    "department": "MATH",
    "course_number": "130",
    "title": "Calculus I for the Life Sciences",
    "description": "Basic ideas of differential integral calculus, with emphasis on elementary techniques and applications to the life sciences.",
    "credits": 4,
    "professors": [
      "Timothy Pilachowski",
      "Joel Cohen",
      "Giovanni Forni",
      "Melissa Macasieb",
      "Casey Cremins",
      "McBlaine Boyle",
      "Michele Coti Zelati",
      "Harry Tamvakis",
      "Sarah Yeakel"
    ],
    "average_gpa": 2.43041
  },
  {
    "department": "MATH",
    "course_number": "131",
    "title": "Calculus II for Life Sciences",
    "description": "Continuation of MATH130, including an introduction to autonomous differential equations, probability (including conditional probability and the normal and binomial distributions), and statistical reasoning (including confidence intervals). Alongside the mathematical concepts will be applications in biology.",
    "credits": 4,
    "professors": [
      "Casey Cremins",
      "Karin Melnick",
      "Timothy Pilachowski",
      "Joel Cohen",
      "McBlaine Boyle",
      "Guan Huang",
      "Giovanni Forni",
      "Michele Coti Zelati",
      "Terence Long",
      "Tamas Darvas",
      "Courtney Davis",
      "Angelo Picardello",
      "Jianlu Zhang"
    ],
    "average_gpa": 2.78542
  },
  {
    "department": "MATH",
    "course_number": "135",
    "title": "Discrete Mathematics for Life Sciences",
    "description": "<b>Prerequisite:</b> Minimum grade of C- in MATH115; or must have math eligibility of MATH140 or higher; and math eligibility is based on the Math Placement Test.\n<b>Restriction:</b> Must be in the Biological Sciences or Neuroscience major; and not open to students majoring in mathematics, engineering, or the physical sciences.\nBasic discrete mathematics, with emphasis on relevant models and techniques to the life sciences.",
    "credits": 4,
    "professors": [
      "Casey Cremins",
      "Heyrim Cho",
      "Tobias von Petersdorff",
      "Tamas Darvas",
      "Jakob Hultgren",
      "Shelby Wilson",
      "Todd Rowland",
      "Scott Preston"
    ],
    "average_gpa": 2.99745
  },
  {
    "department": "MATH",
    "course_number": "136",
    "title": "Calculus for Life Sciences",
    "description": "<b>Prerequisite:</b> Minimum grade of C- in MATH135.\n<b>Restriction:</b> Must be in the Biological Sciences or Neuroscience major.\n<b>Credit only granted for:</b> MATH120, MATH130, MATH136, or MATH140.\nContinuation of MATH135, including basic ideas of differential integral calculus, with emphasis on elementary techniques and applications to the life sciences.",
    "credits": 4,
    "professors": [
      "Changguang Dong",
      "Ruiwen Shu",
      "Joel Cohen",
      "Shelby Wilson",
      "Weikun Wang",
      "Agnieszka Zelerowicz",
      "Hussain Ibdah"
    ],
    "average_gpa": 3.31431
  },
  {
    "department": "MATH",
    "course_number": "140",
    "title": "Calculus I",
    "description": "<b>Prerequisite:</b> Minimum grade of C- in MATH115. Or must have math eligibility of MATH140 or higher; and math eligibility is based on the Math Placement Test.\n<b>Credit only granted for:</b> MATH120, MATH130, MATH136, MATH140 or MATH220.\nIntroduction to calculus, including functions, limits, continuity, derivatives and applications of the derivative, sketching of graphs of functions, definite and indefinite integrals, and calculation of area. The course is especially recommended for science, engineering and mathematics majors.\n<i>Graphing calculators, or computers, etc., with software appropriate for graphing non-trivial functions and doing non-trivial calculations, will be needed.</i>",
    "credits": 4,
    "professors": [
      "Bradford Sanders",
      "David Hamilton",
      "Denny Gulick",
      "Kasso Okoudjou",
      "Frances Gulick",
      "Terence Long",
      "Wujun Zhang",
      "Eric Hamilton",
      "Amin Gholampour",
      "Jonathan Fernandes",
      "Timothy Pilachowski",
      "Stephen Balady",
      "Steven Chadwick",
      "Benjamin Manning",
      "Arijit Sehanobish",
      "Yue Zhao",
      "Patrick Brosnan",
      "Nathan Manning",
      "Ariella Kirsch",
      "Arseny Zakharov",
      "Christian Rosendal",
      "Sean Ballentine",
      "Jacob Renn",
      "Craig Schlenoff",
      "Elizabeth Wilson",
      "Paul Koprowski",
      "Wei-Hsuan Yu",
      "Domingo Ruiz",
      "James Murphy",
      "Ran Cui",
      "Renjie Feng",
      "Caleb Ashley",
      "Tingyue Gan",
      "Cara Peters",
      "Matthew Becker",
      "Robert Maschal",
      "Adam Telatovich",
      "Changguang Dong",
      "Fei Wang",
      "Ke Xue",
      "Mestiyage Gunatilleka",
      "Ryan Hunter",
      "Wiseley Wong",
      "Asia Wyatt",
      "Jeremiah Emidih",
      "Philip Wertheimer",
      "Roohollah Ebrahimian",
      "Rufus Elemo",
      "Archana Khurana",
      "Guangyu Xi",
      "Sahil Chopra",
      "Tao Zhang",
      "Zachary Greenberg",
      "Jingren Chi",
      "Stefan Doboszczak",
      "Xuemiao Chen",
      "Yordanka Kovacheva",
      "Zack Greenberg",
      "Kayla Davie",
      "Kendall Williams",
      "Nelson Moll",
      "Eoin Mackall"
    ],
    "average_gpa": 2.20887
  },
  {
    "department": "MATH",
    "course_number": "140H",
    "title": "Calculus I",
    "description": "<b>Prerequisite:</b> Minimum grade of C- in MATH115. Or must have math eligibility of MATH140 or higher; and math eligibility is based on the Math Placement Test.\n<b>Credit only granted for:</b> MATH120, MATH130, MATH136, MATH140 or MATH220.\nIntroduction to calculus, including functions, limits, continuity, derivatives and applications of the derivative, sketching of graphs of functions, definite and indefinite integrals, and calculation of area. The course is especially recommended for science, engineering and mathematics majors.\n<i>For general honors students only. Offered fall only. All sections will require the use of a TI graphics calculator. Instructor will use a TI-83 TI-83+, TI 84, TI 84+, TI 86, or TI 89 calculator.</i>",
    "credits": 4,
    "professors": [
      "Vadim Kaloshin",
      "Kelly Yancey",
      "Steven Chadwick",
      "Archana Khurana",
      "Nathan Manning",
      "Sabrina Rainwater",
      "Mahesh Nerurkar",
      "Dragomir Saric",
      "Xiumin Du",
      "Jacob Bedrossian"
    ],
    "average_gpa": 3.04311
  },
  {
    "department": "MATH",
    "course_number": "141",
    "title": "Calculus II",
    "description": "<b>Prerequisite:</b> Minimum grade of C- in MATH140. Or 1 course with a minimum grade of B- from (MATH130, MATH136); and permission of CMNS-Mathematics department.\n<b>Credit only granted for:</b> MATH121, MATH131, MATH141, or MATH221.\nContinuation of MATH140, including techniques of integration, improper integrals, applications of integration (such as volumes, work, arc length, moments), inverse functions, exponential and logarithmic functions, sequences and series.\n<i>All sections will require the use of a TI graphics calculator. Instructor will use a TI-83, TI-83+, or TI-86 calculator. Emphasis on student interaction in groups, including team approach to solving calculus based problems. In addition to the lectures, there will be 2 eighty-minute workshops each week with enhanced assistance and support for students. If purchasing used books additional software may be required.</i>",
    "credits": 4,
    "professors": [
      "Denny Gulick",
      "Kasso Okoudjou",
      "Frances Gulick",
      "Kenneth Berg",
      "Jonathan Rosenberg",
      "David Hamilton",
      "Ioannis Markou",
      "Bradford Sanders",
      "Wojciech Czaja",
      "Amin Gholampour",
      "Terence Long",
      "Wiseley Wong",
      "Eric Hamilton",
      "Jeffrey Adams",
      "Steven Chadwick",
      "Nathaniael Manning",
      "Swarnava Mukhopadhyay",
      "Archana Khurana",
      "Timothy Pilachowski",
      "Roohollah Ebrahimian",
      "Maxx Cho",
      "Scott Wolpert",
      "William Martin",
      "Elizabeth Wilson",
      "Paul Koprowski",
      "Caleb Ashley",
      "Adam Lizzi",
      "Corry Bedwell",
      "Samuel Bloom",
      "Patrick Brosnan",
      "Ruiwen Shu",
      "Daniel Kaufman",
      "Mestiyage Gunatilleka",
      "Sahil Chopra",
      "Adam Telatovich",
      "Bo Tian",
      "Cara Peters",
      "Martin Molina Fructuoso",
      "Brian Smithling",
      "Jakob Hultgren",
      "Nathan Manning",
      "Gregory Chadwick",
      "Yijing Wu",
      "Yordanka Kovacheva",
      "Stefan Doboszczak",
      "Jingren Chi",
      "Jonathan Fernandes",
      "Ishfaaq Mohammed Imtiyas",
      "JT Rustad",
      "Jianlong Liu",
      "Todd Rowland",
      "Brandon Johnson",
      "Laura Iosip",
      "Hatice Sahinoglu",
      "Josue Avila Artavia",
      "Brandon Alexander",
      "John Quah"
    ],
    "average_gpa": 2.2261
  },
  {
    "department": "MATH",
    "course_number": "141H",
    "title": "Calculus II",
    "description": "<b>Prerequisite:</b> Minimum grade of C- in MATH140. Or 1 course with a minimum grade of B- from (MATH130, MATH136); and permission of CMNS-Mathematics department.\n<b>Credit only granted for:</b> MATH121, MATH131, MATH141, or MATH221.\nContinuation of MATH140, including techniques of integration, improper integrals, applications of integration (such as volumes, work, arc length, moments), inverse functions, exponential and logarithmic functions, sequences and series.\n<i>For Honors College students only. Graphing calculators, or computers, etc., with software appropriate for graphing non-trivial functions and doing non-trivial calculations, will be needed.</i>",
    "credits": 4,
    "professors": [
      "Wojciech Czaja",
      "Bradford Sanders",
      "Vadim Kaloshin",
      "David Hamilton",
      "Kenneth Berg",
      "Peter Nandori",
      "Joseph Iverson",
      "Wiseley Wong",
      "Steven Chadwick",
      "Archana Khurana",
      "Huanchen Bao",
      "Allan Yashinski",
      "Hantaek Bae",
      "William Martin",
      "Roberto De Leo",
      "Xuemei Chen",
      "Horst Winkelnkemper",
      "Nathan Manning",
      "Stephen Balady",
      "Xiumin Du",
      "Mestiyage Gunatilleka",
      "Yijing Wu",
      "Changguang Dong",
      "Jonathan Fernandes",
      "Todd Rowland",
      "Jonathan Rosenberg",
      "Hussain Ibdah"
    ],
    "average_gpa": 3.07529
  },
  {
    "department": "MATH",
    "course_number": "199A",
    "title": "Special Topics in Mathematics",
    "description": null,
    "credits": 3,
    "professors": ["Denny Gulick"],
    "average_gpa": null
  },
  {
    "department": "MATH",
    "course_number": "199B",
    "title": null,
    "description": null,
    "credits": null,
    "professors": ["Denny Gulick"],
    "average_gpa": null
  },
  {
    "department": "MATH",
    "course_number": "206",
    "title": "Introduction to Matlab",
    "description": "<b>Prerequisite:</b> 1 course with a minimum grade of C- from (MATH136, MATH140).\nThis course is intended to prepare students for subsequent courses requiring computation with MATLAB. Covers basics of MATLAB including simple commands, variables, solving equations, graphing differentiation and integration, matrices and vectors, functions, M-files and fundamentals of programming in the MATLAB environment. When offered in Winter and Summer terms, the course is offered in a format suitable for online distance learning.",
    "credits": 1,
    "professors": ["Justin Wyss-Gallifent"],
    "average_gpa": 3.52099
  },
  {
    "department": "MATH",
    "course_number": "212",
    "title": "Elements of Numbers and Operations",
    "description": "<b>Prerequisite:</b> Must have completed one year of college preparatory algebra.\n<b>Restriction:</b> Must be in one of the following programs (Early Childhood Education; Special Education; Elementary Education).\n<b>Credit only granted for:</b> MATH212 or MATH210.\nReviews and extends topics of arithmetic and number theory related to the elementary school curriculum, particularly number systems and operations with natural numbers, integers, and rationals.",
    "credits": 3,
    "professors": [
      "Karen McLaren",
      "Matthew Becker",
      "Rebecca Black",
      "Jenny Rustad",
      "Angela Stoltz",
      "Carolina Napp-Avelli",
      "Robert Maschal",
      "Bradford Sanders",
      "Barbie Dunnan",
      "Jonathan Marshall",
      "Brett Williams",
      "Gregory Laun",
      "Elizabeth Johnson",
      "Kimberly Fouche",
      "Clarice Glowacki",
      "Nathan Dykas",
      "Viktoria Taroudaki",
      "Diana Bowen",
      "Christopher Dock",
      "Kristyn Lue",
      "Tarik Buli",
      "Kelly Ivy",
      "Yaqi Wu"
    ],
    "average_gpa": 3.06007
  },
  {
    "department": "MATH",
    "course_number": "213",
    "title": "Elements of Geometry and Measurement",
    "description": "<b>Prerequisite:</b> MATH212.\n<b>Restriction:</b> Must be in one of the following programs (Early Childhood Education; Special Education; Elementary Education).\n<b>Credit only granted for:</b> MATH211 or MATH213.\nProperties of geometric objects in two and three dimensions; parallel lines, curves and polygons; ratio, proportion, similarity; transformational geometry and measurement, constructions, justifications and proofs.",
    "credits": 3,
    "professors": [
      "Terence Long",
      "Karen McLaren",
      "Sean Ballentine",
      "David Pincus",
      "Timothy Mercure",
      "Alice Cook",
      "Rajat Srivastava",
      "Alexis Boleda",
      "Colleen Stock",
      "Dana-Adriana Botesteanu",
      "Monica Dunsworth",
      "Sean Gruber",
      "Tarik Buli",
      "Mirna Pinsky",
      "S Gilles",
      "Laura Iosip",
      "Veronica Carlan"
    ],
    "average_gpa": 3.13803
  },
  {
    "department": "MATH",
    "course_number": "214",
    "title": "Elements of Probability and Statistics",
    "description": "<b>Prerequisite:</b> MATH212.\n<b>Restriction:</b> Must be in one of the following programs (Early Childhood Education; Special Education; Elementary Education).\n<b>Credit only granted for:</b> MATH211 or MATH214.\nPermutations and combinations; probability; collecting and representing data; using statistics to analyze and interpret data.",
    "credits": 3,
    "professors": [
      "Stephen Kcenich",
      "Timothy Pilachowski",
      "Sean Ballentine",
      "Jesse Milzman",
      "Eric Hamilton",
      "Karen McLaren",
      "Joshua Himmelsbach",
      "William Viviani",
      "Alexis Boleda",
      "Jonathan Fernandes",
      "Matthew Wilson",
      "Matt Wilson",
      "Siddharth Sharma"
    ],
    "average_gpa": 3.29812
  },
  {
    "department": "MATH",
    "course_number": "220",
    "title": "Elementary Calculus I",
    "description": "Basic ideas of differential and integral calculus, with emphasis on elementary techniques of differentiation and applications.",
    "credits": 3,
    "professors": [
      "Joel Cohen",
      "Patrick Fitzpatrick",
      "Timothy Pilachowski",
      "Bradford Sanders",
      "Nathan Manning",
      "Tamas Darvas",
      "Gadi Fibich",
      "Daniel Weinberg",
      "Eric Hamilton",
      "Lawrence Washington",
      "Hilaf Hasson",
      "Sarah Yeakel",
      "Heyrim Cho",
      "Ioannis Markou",
      "David Flynn",
      "Sean Rostami",
      "Kimberly Fouche",
      "Julia Dobrosotskaya",
      "Abner Salgado Gonzalez",
      "Xuemei Chen",
      "Elizabeth Wilson",
      "Karamatou Yacoubou Djima",
      "Paul Koprowski"
    ],
    "average_gpa": 2.41937
  },
  {
    "department": "MATH",
    "course_number": "221",
    "title": "Elementary Calculus II",
    "description": "Differential and integral calculus, with emphasis on elementary techniques of integration and applications.",
    "credits": 3,
    "professors": [
      "Timothy Pilachowski",
      "David Pincus",
      "Zhao Liu",
      "Jonathan Cohen",
      "Yichun Zhu",
      "Sabrina Rainwater",
      "Oliver Rourke"
    ],
    "average_gpa": 2.62864
  },
  {
    "department": "MATH",
    "course_number": "240",
    "title": "Introduction to Linear Algebra",
    "description": "<b>Prerequisite:</b> 1 course with a minimum grade of C- from (MATH131, MATH141).\n<b>Credit only granted for:</b> MATH240, MATH341, or MATH461.\nBasic concepts of linear algebra: vector spaces, applications to line and plane geometry, linear equations and matrices, similar matrices, linear transformations, eigenvalues, determinants and quadratic forms.\n<i>All Sections will use MATLAB.</i>",
    "credits": 4,
    "professors": [
      "McBlaine Boyle",
      "Raluca Rosca",
      "Maria Cameron",
      "Allan Yashinski",
      "Nathaniael Manning",
      "Terence Long",
      "Joseph Iverson",
      "Renjie Feng",
      "Rebecca Black",
      "Sean Ballentine",
      "Alex Blumenthal",
      "Thibaut Castan",
      "Ryan Hunter",
      "Samuel Bloom",
      "S Gilles",
      "Weikun Wang",
      "Xin Dong",
      "Mestiyage Gunatilleka",
      "Nathan Manning",
      "Archana Khurana",
      "Zehua Zhao",
      "David Bekkerman",
      "Laura Iosip",
      "Stefan Doboszczak",
      "Wiseley Wong",
      "Eoin Mackall",
      "Stavros Papathanasiou",
      "Dmitrii Gudin"
    ],
    "average_gpa": 2.46563
  },
  {
    "department": "MATH",
    "course_number": "241",
    "title": "Calculus III",
    "description": "<b>Prerequisite:</b> Minimum grade of C- in MATH141.\n<b>Credit only granted for:</b> MATH241 or MATH340.\nIntroduction to multivariable calculus, including vectors and vector-valued functions, partial derivatives and applications of partial derivatives (such as tangent planes and Lagrange multipliers), multiple integrals, volume, surface area, and the classical theorems of Green, Stokes and Gauss.\n<i>All sections will use MATLAB.</i>",
    "credits": 4,
    "professors": [
      "Justin Wyss-Gallifent",
      "Melissa Macasieb",
      "Raluca Rosca",
      "Antoine Mellet",
      "Manoussos Grillakis",
      "Casey Cremins",
      "Dionisios Margetis",
      "Tobias von Petersdorff",
      "Swarnava Mukhopadhyay",
      "Ioannis Markou",
      "Roohollah Ebrahimian",
      "Timothy Pilachowski",
      "Wiseley Wong",
      "Kendall Williams",
      "Peter Nandori",
      "Terence Long",
      "Christian Rosendal",
      "Michael Laskowski",
      "Elizabeth Wilson",
      "Mahesh Nerurkar",
      "Ryan Kirk",
      "David Hamilton",
      "Ke Xue",
      "S Gilles",
      "Matei Machedon",
      "David Russell",
      "Jacky Chong",
      "Brandon Alexander",
      "Sarah Burnett",
      "Stefan Doboszczak",
      "Patrick Brosnan",
      "Ran Tao",
      "Yijing Wu"
    ],
    "average_gpa": 2.64391
  },
  {
    "department": "MATH",
    "course_number": "241H",
    "title": "Calculus III",
    "description": "<b>Prerequisite:</b> Minimum grade of C- in MATH141.\n<b>Credit only granted for:</b> MATH241 or MATH340.\nIntroduction to multivariable calculus, including vectors and vector-valued functions, partial derivatives and applications of partial derivatives (such as tangent planes and Lagrange multipliers), multiple integrals, volume, surface area, and the classical theorems of Green, Stokes and Gauss.\n<i>For Honors College students only. MATH 241H will use MATLAB.</i>",
    "credits": 4,
    "professors": [
      "Frances Gulick",
      "Niranjan Ramachandran",
      "Timothy Pilachowski",
      "Wujun Zhang",
      "Wiseley Wong",
      "Huanchen Bao",
      "Kendall Williams",
      "Daisy Dahiya",
      "Christian Rosendal",
      "Terence Long",
      "Jonathan Rosenberg",
      "David Hamilton",
      "Samuel Punshon-Smith",
      "Elizabeth Wilson",
      "William Martin",
      "Horst Winkelnkemper",
      "Michelle Lee",
      "Roman Andreev",
      "Dragomir Saric",
      "Dong Dong",
      "Raluca Rosca",
      "Bradford Sanders",
      "Guangyu Xi",
      "Nathaniael Manning",
      "Nathan Manning",
      "Agnieszka Zelerowicz",
      "Zehua Zhao",
      "Comlan Koudjinan",
      "Allan Yashinski",
      "Antonio De Rosa",
      "Xiaoqi Huang",
      "Christopher Moakler",
      "Changguang Dong",
      "Michael Laskowski",
      "Roohollah Ebrahimian"
    ],
    "average_gpa": 3.17493
  },
  {
    "department": "MATH",
    "course_number": "246",
    "title": "Differential Equations for Scientists and Engineers",
    "description": "<b>Prerequisite:</b> Minimum grade of C- in MATH141.\n<b>Credit only granted for:</b> MATH246 or MATH341.\nAn introduction to the basic methods of solving ordinary differential equations. Equations of first and second order, linear differential equations, Laplace transforms, numerical methods and the qualitative theory of differential equations.\n<i>All sections will use MATLAB.</i>",
    "credits": 3,
    "professors": [
      "Charles Levermore",
      "Matei Machedon",
      "Casey Cremins",
      "Maria Cameron",
      "Michael Jakobson",
      "Terence Long",
      "Alice Wang",
      "Justin Wyss-Gallifent",
      "Antoine Mellet",
      "Gadi Fibich",
      "Roohollah Ebrahimian",
      "Christian Zickert",
      "Kendall Williams",
      "Ronald Lipsman",
      "Elizabeth Wilson",
      "Jacky Chong",
      "Jonathan Fernandes",
      "Xin Dong",
      "Jeffrey Adams",
      "David Hamilton",
      "Fei Wang",
      "Corry Bedwell",
      "Martin Molina Fructuoso",
      "Adam Telatovich",
      "Jonathan Rosenberg",
      "Brandon Alexander",
      "Siddharth Sharma",
      "Rodrigo Trevino",
      "Ruiwen Shu",
      "Eric Oden",
      "Keith Mills",
      "Luis Suarez",
      "Manoussos Grillakis",
      "Yijing Wu",
      "Christopher Dock",
      "Vladimir Yushutin",
      "Stefan Doboszczak"
    ],
    "average_gpa": 2.5061
  },
  {
    "department": "MATH",
    "course_number": "246H",
    "title": "Differential Equations for Scientists and Engineers",
    "description": "<b>Prerequisite:</b> Minimum grade of C- in MATH141.\n<b>Credit only granted for:</b> MATH246 or MATH341.\nAn introduction to the basic methods of solving ordinary differential equations. Equations of first and second order, linear differential equations, Laplace transforms, numerical methods and the qualitative theory of differential equations.\n<i>For Honors College students only. MATH 246H will use MATLAB.</i>",
    "credits": 3,
    "professors": [
      "Michael Jakobson",
      "Richard Wentworth",
      "Tobias von Petersdorff",
      "Christian Zickert",
      "Kelly Yancey",
      "Yanir Rubinstein",
      "Roohollah Ebrahimian",
      "Kendall Williams",
      "Koushik Pal",
      "Thibaut Castan",
      "Javier Morales Delgado",
      "Sarah Yeakel",
      "Changguang Dong",
      "Jonathan Fernandes",
      "Mestiyage Gunatilleka",
      "Xuemiao Chen",
      "Rodrigo Trevino",
      "Zehua Zhao",
      "Terence Long",
      "Raymond Schram"
    ],
    "average_gpa": 3.1063
  },
  {
    "department": "MATH",
    "course_number": "270",
    "title": "Social Networks:  A Mathematical Exploration",
    "description": "An increasingly large amount of information is being collected about us through our footprints on social media, our use of smartwatches and fitness trackers, and our online shopping routines. It is important that we educate ourselves on how data is being gathered, what it is being used for, and why such data can be both a blessing and a curse. In this course we will investigate these questions through the mathematical exploration of social networks. This will be accomplished by using publicly available social networks data, and by generating our own data. For example, the course project will be based on collecting, organizing, and analyzing data gathered by the class from the students in the Carillon Communities. These data could include activity trackers data, survey about music, movies, reading preferences from students the cohort.",
    "credits": 3,
    "professors": ["Kasso Okoudjou"],
    "average_gpa": null
  },
  {
    "department": "MATH",
    "course_number": "274",
    "title": "History of Mathematics",
    "description": "<b>Prerequisite:</b> MATH120, MATH130, MATH136, or MATH140; or must have completed MATH220.\nAn overview of aspects in the history of mathematics from its beginning in the concrete problem solving of ancient times through the development of abstraction in the 19th and 20th centuries. The course considers both mathematical ideas and the context in which they developed in various civilizations around the world.\n<i>MATH 274 cannot satisfy a CMSC major requirement.</i>",
    "credits": 3,
    "professors": [
      "Raluca Rosca",
      "Justin Wyss-Gallifent",
      "Kendall Williams",
      "Horst Winkelnkemper",
      "Daniel Chazan",
      "Yanir Rubinstein",
      "Terence Long"
    ],
    "average_gpa": 3.15222
  },
  {
    "department": "MATH",
    "course_number": "299A",
    "title": "Selected Topics in Mathematics",
    "description": null,
    "credits": 1,
    "professors": [],
    "average_gpa": null
  },
  {
    "department": "MATH",
    "course_number": "299B",
    "title": "Selected Topics in Mathematics; Putnam Express",
    "description": null,
    "credits": 1,
    "professors": ["Roohollah Ebrahimian", "Brian Hunt"],
    "average_gpa": 3.22447
  },
  {
    "department": "MATH",
    "course_number": "299C",
    "title": "Selected Topics in Mathematics; STIC:  Music and Mathematics",
    "description": null,
    "credits": 1,
    "professors": ["Niranjan Ramachandran", "Noah Whiteman", "Jeffrey Wack"],
    "average_gpa": 3.65672
  },
  {
    "department": "MATH",
    "course_number": "299E",
    "title": "Selected Topics in Mathematics; The Mathematics of Erdos",
    "description": "Combinatorics is the study of counting. Despite its deceptively simple name, it is one of the most active areas of research in modern mathematics. We discuss some of the basic ideas behind combinatorics, and their unexpected applications. The proofs we discuss are so elegant that Paul Erdos once said they are from The Book God s book of the most elegant proof of each theorem. This is a Student Taught Initiated Courseand will be led by students, not faculty.\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\r\n\t\t\t\t\t\t\t\t\t\t\t\t\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t  A student-led course through Student-Initiated Courses (STICs) @ UMD: http://stics.umd.edu/   Please click here for more information.",
    "credits": 1,
    "professors": ["Lawrence Washington"],
    "average_gpa": 4.0
  },
  {
    "department": "MATH",
    "course_number": "299F",
    "title": "Selected Topics in Mathematics; STIC: Foundations of Mathematics",
    "description": null,
    "credits": 1,
    "professors": ["Roohollah Ebrahimian"],
    "average_gpa": 2.61667
  },
  {
    "department": "MATH",
    "course_number": "299G",
    "title": "Selected Topics in Mathematics; Geometry in Physics",
    "description": "<i>A student-led course through Student-Initiated Courses (STICs) @ UMD: http://stics.umd.edu/   Please click here for more information.</i>",
    "credits": 1,
    "professors": ["Tamas Darvas"],
    "average_gpa": null
  },
  {
    "department": "MATH",
    "course_number": "299I",
    "title": "Selected Topics in Mathematics; Introduction to Category Theory",
    "description": "<i>A student-led course through Student-Initiated Courses (STICs) @ UMD: http://stics.umd.edu/   Please click here for more information.</i>",
    "credits": 1,
    "professors": ["Richard Wentworth"],
    "average_gpa": null
  },
  {
    "department": "MATH",
    "course_number": "299J",
    "title": "Selected Topics in Mathematics; Spectral Graph Theory and Applications",
    "description": "<i>A student-led course through Student-Initiated Courses (STICs) @ UMD: http://stics.umd.edu/   Please click here for more information.</i>",
    "credits": 1,
    "professors": ["Wiseley Wong"],
    "average_gpa": null
  },
  {
    "department": "MATH",
    "course_number": "299M",
    "title": "Selected Topics in Mathematics; Visualization through Mathematica",
    "description": "<i>Prerequisites: MATH140 and MATH141 (or equivalent).</i>\n<i>A student-led course through Student-Initiated Courses (STICs) @ UMD: http://stics.umd.edu/   Please click here for more information.</i>",
    "credits": 1,
    "professors": [
      "William Goldman",
      "Jason Filippou",
      "Iason Filippou",
      "Pedram Sadeghian"
    ],
    "average_gpa": 3.20889
  },
  {
    "department": "MATH",
    "course_number": "299N",
    "title": "Selected Topics in Mathematics",
    "description": null,
    "credits": 1,
    "professors": ["Lawrence Washington"],
    "average_gpa": 3.46667
  },
  {
    "department": "MATH",
    "course_number": "299O",
    "title": "Selected Topics in Mathematics; STIC: Algorithms and Probability in Board Games with a Focusof Bridge",
    "description": "A student-led course through Student-Initiated Courses (STICs) @ UMD: http://stics.umd.edu/   Please click here for more information.",
    "credits": 1,
    "professors": ["Lawrence Washington"],
    "average_gpa": 3.72
  },
  {
    "department": "MATH",
    "course_number": "299P",
    "title": "Selected Topics in Mathematics; Proofs from The Book",
    "description": null,
    "credits": 1,
    "professors": ["Lawrence Washington"],
    "average_gpa": 3.69231
  },
  {
    "department": "MATH",
    "course_number": "299T",
    "title": "Selected Topics in Mathematics; STIC:  Poker Theory and Analytics",
    "description": null,
    "credits": 1,
    "professors": ["Sarah Yeakel", "Wiseley Wong"],
    "average_gpa": 3.7
  },
  {
    "department": "MATH",
    "course_number": "299Y",
    "title": "Selected Topics in Mathematics; Teaching Math to a Young Audience",
    "description": "<i>A student-led course through Student-Initiated Courses (STICs) @ UMD: http://stics.umd.edu/   Please click here for more information.</i>",
    "credits": 1,
    "professors": ["Justin Wyss-Gallifent"],
    "average_gpa": null
  },
  {
    "department": "MATH",
    "course_number": "310",
    "title": "Introduction to Mathematical Proof",
    "description": "<b>Prerequisite:</b> Minimum grade of C- in MATH141; and must have completed or be concurrently enrolled in MATH240, MATH341, or MATH461; and must have completed or be concurrently enrolled in MATH241 or MATH340.\n<b>Restriction:</b> Must be in a major within the CMNS-Mathematics department.\n<b>Credit only granted for:</b> MATH307 or MATH310.\n<b>Additional information:</b> Math majors may not use this course to satisfy an upper-level requirement.\nTo develop the students' ability to construct a rigorous proof of a mathematical claim. Students will also be made aware of mathematical results that are of interest to those wishing to analyze a particular mathematical model. Topics will be drawn from logic, set theory, structure of the number line, elementary topology, metric spaces, functions, sequences and continuity.",
    "credits": 3,
    "professors": [
      "Kathryn Truman",
      "Steve Halperin",
      "Kelly Yancey",
      "Richard Rast",
      "Nathaniael Manning",
      "Huanchen Bao",
      "Kendall Williams",
      "Steven Chadwick",
      "Manjit Bhatia",
      "Sarah Yeakel",
      "Jeffrey Adams",
      "Fei Wang",
      "Stephen Balady",
      "Renjie Feng",
      "Justin Wyss-Gallifent",
      "Wiseley Wong",
      "Terence Long",
      "Juan Pablo Borthagaray",
      "Manoussos Grillakis",
      "Nathan Manning",
      "Adam Kanigowski",
      "Mestiyage Gunatilleka",
      "Rodrigo Trevino",
      "Niranjan Ramachandran",
      "Ruiwen Shu",
      "Karin Melnick"
    ],
    "average_gpa": 2.06706
  },
  {
    "department": "MATH",
    "course_number": "312",
    "title": "Mathematical Reasoning and Proof for Pre-Service Middle School Teachers",
    "description": "<b>Prerequisite:</b> MATH212 and MATH213.\n<b>Restriction:</b> Must be in one of the following programs (Elementary Education; Special Education; Middle School Education).\nReasoning and proof as addressed in the middle school curriculum. Topics include proportional reasoning, logic and proof, types of numbers, field axioms, Euclidean and non-Euclidean geometry.",
    "credits": 3,
    "professors": [
      "John Seelke",
      "Carolina Napp-Avelli",
      "Alice Cook",
      "Orly Buchbinder",
      "Diana Bowen",
      "Monica Anthony",
      "Monica Dunsworth",
      "Sean Gruber"
    ],
    "average_gpa": 3.65253
  },
  {
    "department": "MATH",
    "course_number": "314",
    "title": "Introduction to Probability, Data, Analysis and Statistics for Preservice Middle School Teachers",
    "description": "<b>Prerequisite:</b> MATH214.\n<b>Restriction:</b> Must be in one of the following programs (Elementary Education; Special Education; Middle School Education).\n<b>Credit only granted for:</b> MATH314 or STAT100.\nAnalysis of bivariate data, probability and randomness, law of large numbers, central limit theorem, probabilities for independent and dependent events, counting techniques, random variables and probability distributions, expected values, sampling distributions, and confidence intervals.",
    "credits": 3,
    "professors": [
      "Rodrigo Gutierrez",
      "Elizabeth Fleming",
      "Angela Stoltz",
      "William Viviani",
      "Peter Moon"
    ],
    "average_gpa": 3.76782
  },
  {
    "department": "MATH",
    "course_number": "315",
    "title": "Algebra for Preservice Middle School Teachers",
    "description": "<b>Prerequisite:</b> MATH212.\n<b>Restriction:</b> Must be in one of the following programs (Elementary Education; Special Education; Middle School Education).\n<b>Credit only granted for:</b> MATH112, MATH113, or MATH315.\nAlgebraic concepts and techniques developed in the middle grades, with their larger mathematical context. Equations, inequalities and functions (linear, polynomial, exponential, logarithmic), with multiple representations of relationships. Common misconceptions of beginning algebra students.",
    "credits": 3,
    "professors": ["Karen McLaren", "Carolina Napp-Avelli"],
    "average_gpa": 3.42082
  },
  {
    "department": "MATH",
    "course_number": "340",
    "title": "Multivariable Calculus, Linear Algebra and Differential Equations I (Honors)",
    "description": "<b>Prerequisite:</b> MATH141 and MATH140; and permission of CMNS-Mathematics department; and permission will be granted only to incoming freshmen.\n<b>Credit only granted for:</b> MATH241 or MATH340.\nFirst semester of the MATH340-341 sequence which gives a unified and enriched treatment of multivariable calculus, linear algebra and ordinary differential equations, with supplementary material from subjects such as differential geometry, Fourier series and calculus of variations. Students completing MATH340-341 will have covered the material of MATH240, MATH241, and MATH246, and may not also receive credit for MATH240, MATH241 or MATH246.",
    "credits": 4,
    "professors": [
      "Michael Jakobson",
      "Manoussos Grillakis",
      "Karin Melnick",
      "Heyrim Cho",
      "Richard Wentworth",
      "Niranjan Ramachandran",
      "Hilaf Hasson",
      "Casey Cremins",
      "Brian Hunt",
      "Wiseley Wong",
      "Roohollah Ebrahimian"
    ],
    "average_gpa": 3.16874
  },
  {
    "department": "MATH",
    "course_number": "341",
    "title": "Multivariable Calculus, Linear Algebra, Differential Equations II (Honors)",
    "description": "<b>Prerequisite:</b> Minimum grade of C- in MATH340.\n<b>Restriction:</b> Open to second semester Freshmen only.\n<b>Credit only granted for:</b> MATH240, MATH246, MATH341 or MATH461.\nA continuation of MATH340.",
    "credits": 4,
    "professors": [
      "Niranjan Ramachandran",
      "Raluca Rosca",
      "Thomas Haines",
      "Heyrim Cho",
      "Matei Machedon",
      "Manoussos Grillakis",
      "Sebastien Motsch",
      "Julia Dobrosotskaya",
      "Brian Hunt",
      "Roohollah Ebrahimian",
      "Wiseley Wong",
      "Brian Smithling",
      "Yijing Wu"
    ],
    "average_gpa": 3.31275
  },
  {
    "department": "MATH",
    "course_number": "386",
    "title": "Experiential Learning",
    "description": "<b>Prerequisite:</b> Must have learning proposal approved by the CMNS Mathematics Department.",
    "credits": 3,
    "professors": [],
    "average_gpa": null
  },
  {
    "department": "MATH",
    "course_number": "401",
    "title": "Applications of Linear Algebra",
    "description": "<b>Prerequisite:</b> 1 course with a minimum grade of C- from (MATH461, MATH240, MATH341).\nVarious applications of linear algebra: theory of finite games, linear programming, matrix methods as applied to finite Markov chains, random walk, incidence matrices, graphs and directed graphs, networks and transportation problems.",
    "credits": 3,
    "professors": [
      "Manoussos Grillakis",
      "Pierre-Emmanuel Jabin",
      "Jeffrey Adams",
      "Wujun Zhang",
      "James Schafer",
      "Melissa Macasieb",
      "Raluca Rosca",
      "Wiseley Wong",
      "Wojciech Czaja",
      "Tamas Darvas",
      "Steven Chadwick",
      "Roohollah Ebrahimian",
      "Ricardo Nochetto",
      "Qiaoling Wei",
      "Peter Nandori",
      "Allan Yashinski",
      "Nathan Manning",
      "Justin Wyss-Gallifent",
      "Joseph Iverson",
      "Javier Morales Delgado",
      "Michael Jakobson",
      "Sean Rostami",
      "Harbir Antil",
      "Harland Glaz",
      "Thomas Rey",
      "Marcel Guardia",
      "Enrique Otarola Pasten",
      "Jan Peszek",
      "Samuel Braunfeld",
      "Casey Cremins",
      "Jianlu Zhang",
      "Stephen Balady",
      "Thibaut Castan",
      "Dong Dong",
      "Tobias von Petersdorff",
      "Antoine Mellet",
      "Yordanka Kovacheva",
      "Frances Gulick",
      "Fei Wang",
      "Weikun Wang",
      "Jonathan Fernandes",
      "Stefan Doboszczak",
      "Terence Long",
      "Javier Morales Delgado",
      "Zehua Zhao",
      "Katerina Velcheva",
      "Todd Rowland",
      "Javier  Morales Delgado",
      "Vladimir Yushutin",
      "Rodrigo Trevino",
      "Lutian Zhao"
    ],
    "average_gpa": 2.95326
  },
  {
    "department": "MATH",
    "course_number": "402",
    "title": "Algebraic Structures",
    "description": "<b>Prerequisite:</b> 1 course with a minimum grade of C- from (MATH240, MATH341, MATH461).\n<b>Restriction:</b> Must not be in any of the following programs (Mathematics (Master's); Mathematics (Doctoral)).\n<b>Credit only granted for:</b> MATH402 or MATH403.\nFor students having only limited experience with rigorous mathematical proofs. Parallels MATH403. Students planning graduate work in mathematics should take MATH403. Groups, rings, integral domains and fields, detailed study of several groups; properties of integers and polynomials. Emphasis is on the origin of the mathematical ideas studied and the logical structure of the subject.",
    "credits": 3,
    "professors": [
      "Frances Gulick",
      "Joel Cohen",
      "McBlaine Boyle",
      "Kendall Williams",
      "Horst Winkelnkemper",
      "Steven Chadwick",
      "Allan Yashinski",
      "Christian Zickert",
      "Yordanka Kovacheva",
      "Todd Rowland"
    ],
    "average_gpa": 2.26581
  },
  {
    "department": "MATH",
    "course_number": "403",
    "title": "Introduction to Abstract Algebra",
    "description": "<b>Prerequisite:</b> 1 course with a minimum grade of C- from (MATH240, MATH461, MATH340); and 1 course with a minimum grade of C- from (MATH341, MATH241); and minimum grade of C- in MATH310. Or students who have taken courses with comparable content may contact the department.\n<b>Credit only granted for:</b> MATH402 or MATH403.\nIntegers; groups, rings, integral domains, fields.",
    "credits": 3,
    "professors": [
      "Thomas Haines",
      "James Schafer",
      "Patrick Brosnan",
      "Niranjan Ramachandran",
      "Christian Zickert",
      "Justin Wyss-Gallifent",
      "Melissa Macasieb",
      "Amin Gholampour",
      "Roohollah Ebrahimian",
      "Xuhua He",
      "Koushik Pal",
      "Nathaniael Manning",
      "Nathan Manning",
      "Allan Yashinski"
    ],
    "average_gpa": 2.39664
  },
  {
    "department": "MATH",
    "course_number": "404",
    "title": "Field Theory",
    "description": "<b>Prerequisite:</b> Minimum grade of C- in MATH403.\nAlgebraic and transcendental elements, Galois theory, constructions with straight-edge and compass, solutions of equations of low degrees, insolubility of the quintic equation, Sylow theorems, fundamental theorem of finite Abelian groups.",
    "credits": 3,
    "professors": [
      "Harry Tamvakis",
      "Christian Zickert",
      "Patrick Brosnan",
      "James Schafer"
    ],
    "average_gpa": 2.80408
  },
  {
    "department": "MATH",
    "course_number": "405",
    "title": "Linear Algebra",
    "description": "<b>Prerequisite:</b> 1 course with a minimum grade of C- from (MATH240, MATH461, MATH341); and minimum grade of C- in MATH310.\nAn abstract treatment of finite dimensional vector spaces. Linear transformations and their invariants.",
    "credits": 3,
    "professors": [
      "Niranjan Ramachandran",
      "Amin Gholampour",
      "Maria Cameron",
      "Jeffrey Adams",
      "Patrick Brosnan",
      "Michael Laskowski",
      "Roohollah Ebrahimian",
      "Harry Tamvakis",
      "Dipendra Prasad",
      "Joseph Auslander",
      "Elizabeth Wilson",
      "Michelle Lee",
      "James Schafer",
      "Sarah Yeakel",
      "Huanchen Bao",
      "Matei Machedon",
      "Allan Yashinski",
      "John Millson",
      "Giovanni Forni",
      "Yihang Zhu",
      "Nathan Manning",
      "Adam Kanigowski"
    ],
    "average_gpa": 2.49821
  },
  {
    "department": "MATH",
    "course_number": "406",
    "title": "Introduction to Number Theory",
    "description": "<b>Prerequisite:</b> 1 course with a minimum grade of C- from (MATH240, MATH241, MATH246, MATH340, MATH341, MATH461); or permission of CMNS-Mathematics department.\nIntegers, divisibility, prime numbers, unique factorization, congruences, quadratic reciprocity, Diophantine equations and arithmetic functions.",
    "credits": 3,
    "professors": [
      "Melissa Macasieb",
      "Christian Zickert",
      "Niranjan Ramachandran",
      "Patrick Brosnan",
      "Harry Tamvakis",
      "Thomas Haines",
      "Amin Gholampour",
      "Lawrence Washington",
      "Joel Cohen",
      "Antoine Mellet",
      "Justin Wyss-Gallifent",
      "Xuhua He",
      "Roohollah Ebrahimian",
      "Jonathan Rosenberg",
      "Sarah Yeakel",
      "Allan Yashinski",
      "Manjit Bhatia",
      "James Schafer",
      "David Kueker",
      "Koushik Pal",
      "Michelle Lee",
      "Dragomir Saric",
      "Nathaniael Manning",
      "Yanir Rubinstein",
      "Huanchen Bao",
      "Adam Kanigowski",
      "Samuel Bloom",
      "Jeffrey Adams",
      "Giovanni Forni",
      "Jingren Chi",
      "Steven Chadwick",
      "Nathan Manning",
      "Yordanka Kovacheva",
      "Terence Long",
      "Todd Rowland",
      "Yihang Zhu",
      "Changguang Dong"
    ],
    "average_gpa": 2.62159
  },
  {
    "department": "MATH",
    "course_number": "410",
    "title": "Advanced Calculus I",
    "description": "<b>Prerequisite:</b> 1 course with a minimum grade of C- from (MATH240, MATH461, MATH341); and 1 course with a minimum grade of C- from (MATH340, MATH241); and minimum grade of C- in MATH310. Or students who have taken courses with comparable content may contact the department.\nFirst semester of a year course. Subjects covered during the year are: sequences and series of numbers, continuity and differentiability of real valued functions of one variable, the Riemann integral, sequences of functions and power series. Functions of several variables including partial derivatives, multiple integrals, line and surface integrals. The implicit function theorem.",
    "credits": 3,
    "professors": [
      "Justin Wyss-Gallifent",
      "Leonid Koralov",
      "Denny Gulick",
      "McBlaine Boyle",
      "David Hamilton",
      "Matei Machedon",
      "Giovanni Forni",
      "Swarnava Mukhopadhyay",
      "Sandra Cerrai",
      "Kasso Okoudjou",
      "Charles Levermore",
      "Michele Coti Zelati",
      "Michael Laskowski",
      "Benjamin Manning",
      "Roohollah Ebrahimian",
      "Hilaf Hasson",
      "Christian Rosendal",
      "Steven Chadwick",
      "Jacob Bedrossian",
      "Manoussos Grillakis",
      "Kendall Williams",
      "Nathaniael Manning",
      "Elizabeth Wilson",
      "Abner Salgado Gonzalez",
      "Casey Cremins",
      "Peter Nandori",
      "Fei Wang",
      "Richard Wentworth",
      "Tobias von Petersdorff",
      "Patrick Fitzpatrick",
      "Samuel Bloom",
      "Changguang Dong",
      "Nathan Manning",
      "Stefan Doboszczak",
      "Terence Long",
      "Xiumin Du",
      "Archana Khurana",
      "Xuemiao Chen",
      "Antoine Mellet",
      "Doron Levy",
      "Eoin Mackall",
      "Lei Chen",
      "Huy Nguyen"
    ],
    "average_gpa": 2.36398
  },
  {
    "department": "MATH",
    "course_number": "411",
    "title": "Advanced Calculus II",
    "description": "<b>Prerequisite:</b> Minimum grade of C- in MATH410; and permission of CMNS-Mathematics department.\n<b>Credit only granted for:</b> MATH411 or MATH412.\nContinuation of MATH410.",
    "credits": 3,
    "professors": [
      "McBlaine Boyle",
      "Wojciech Czaja",
      "Manoussos Grillakis",
      "Matei Machedon",
      "Justin Wyss-Gallifent",
      "Swarnava Mukhopadhyay",
      "James Schafer",
      "Benjamin Manning",
      "Roohollah Ebrahimian",
      "Patrick Brosnan",
      "Michele Coti Zelati",
      "Patrick Fitzpatrick",
      "Leonid Koralov",
      "David Hamilton",
      "Matthias Goerner",
      "Kendall Williams",
      "Richard Wentworth",
      "Giovanni Forni",
      "Huy Nguyen",
      "Ricardo Nochetto"
    ],
    "average_gpa": 2.53858
  },
  {
    "department": "MATH",
    "course_number": "412",
    "title": null,
    "description": null,
    "credits": null,
    "professors": ["Charles Levermore", "Sebastien Motsch"],
    "average_gpa": 2.04444
  },
  {
    "department": "MATH",
    "course_number": "416",
    "title": "Applied Harmonic Analysis: An Introduction to Signal Processing",
    "description": "<b>Prerequisite:</b> Minimum grade of C- in MATH141; and 1 course with a minimum grade of C- from (MATH240, MATH461, MATH341); and familiarity with MATLAB is required.\nIntroduces students to the mathematical concepts arising in signal analysis from the applied harmonic analysis point of view. Topics include applied linear algebra, Fourier series, discrete Fourier transform, Fourier transform, Shannon Sampling Theorem, wavelet bases, multiresolution analysis, and discrete wavelet transform.",
    "credits": 3,
    "professors": [
      "Wojciech Czaja",
      "McBlaine Boyle",
      "Benjamin Manning",
      "Radu Balan",
      "Julia Dobrosotskaya",
      "Xuemei Chen",
      "Kasso Okoudjou",
      "Charles Levermore",
      "Stefan Doboszczak"
    ],
    "average_gpa": 2.16215
  },
  {
    "department": "MATH",
    "course_number": "420",
    "title": "Mathematical Modeling",
    "description": "<b>Prerequisite:</b> 1 course with a minimum grade of C- from (MATH240, MATH461, MATH341); and 1 course with a minimum grade of C- from (MATH241, MATH340); and 1 course with a minimum grade of C- from (MATH246, MATH341); and minimum grade of C- in STAT400. And 1 course with a minimum grade of C- from (CMSC106, CMSC131); or students who have taken courses with comparable content may contact the department. Cross-listed with AMSC420.\n<b>Credit only granted for:</b> AMSC420 or MATH420.\nThe course will develop skills in data-driven mathematical modeling through individual and group projects. Emphasis will be placed on both analytical and computational methods, and on effective oral and written presentation of results.",
    "credits": 3,
    "professors": [
      "Charles Levermore",
      "Wojciech Czaja",
      "Brian Hunt",
      "Radu Balan"
    ],
    "average_gpa": 2.97708
  },
  {
    "department": "MATH",
    "course_number": "424",
    "title": "Introduction to the Mathematics of Finance",
    "description": "<b>Prerequisite:</b> Minimum grade of C- in MATH141; and 1 course with a minimum grade of C- from (STAT400, STAT410); and permission of CMNS-Mathematics department.\n<b>Recommended:</b> MATH246, MATH240, MATH241, MATH340, or MATH341.\n<b>Credit only granted for:</b> BMGT444, MATH424.\nIntroduction to the mathematical models used in finance and economics with emphasis on pricing derivative instruments. Designed for students in mathematics, computer science, engineering, finance and physics. Financial markets and instruments; elements from basic probability theory; interest rates and present value analysis; normal distribution of stock returns; option pricing; arbitrage pricing theory; the multiperiod binomial model; the Black-Scholes option pricing formula; proof of the Black-Scholes option pricing formula and applications; trading and hedging of options; Delta hedging; utility functions and portfolio theory; elementary stochastic calculus; Ito's Lemma; the Black-Scholes equation and its conversion to the heat equation.",
    "credits": 3,
    "professors": [
      "Dmitry Dolgopyat",
      "Tobias von Petersdorff",
      "Dionisios Margetis",
      "Steven Chadwick",
      "Dragomir Saric",
      "Bradford Sanders",
      "Konstantina Trivisa",
      "Guangyu Xi"
    ],
    "average_gpa": 2.87896
  },
  {
    "department": "MATH",
    "course_number": "430",
    "title": "Euclidean and Non-Euclidean Geometries",
    "description": "<b>Prerequisite:</b> 1 course with a minimum grade of C- from (MATH240, MATH341, MATH461).\nHilbert's axioms for Euclidean geometry. Neutral geometry: the consistency of the hyperbolic parallel postulate and the inconsistency of the elliptic parallel postulate with neutral geometry. Models of hyperbolic geometry. Existence and properties of isometries.",
    "credits": 3,
    "professors": [
      "Frances Gulick",
      "Yanir Rubinstein",
      "Melissa Macasieb",
      "Karin Melnick",
      "Tamas Darvas",
      "Samuel Bloom",
      "Roohollah Ebrahimian",
      "Brian Collier",
      "William Goldman",
      "Terence Long",
      "Rodrigo Trevino"
    ],
    "average_gpa": 2.54433
  },
  {
    "department": "MATH",
    "course_number": "431",
    "title": "Geometry for Computer Applications",
    "description": "<b>Prerequisite:</b> 1 course with a minimum grade of C- from (MATH461, MATH240, MATH341).\nTopics from projective geometry and transformation geometry, emphasizing the two-dimensional representation of three-dimensional objects and objects moving about in the  plane and space.  The emphasis will be on formulas and algorithms of immediate use in computer graphics.",
    "credits": 3,
    "professors": [
      "William Goldman",
      "James Schafer",
      "Brian Collier",
      "Justin Wyss-Gallifent"
    ],
    "average_gpa": 2.75654
  },
  {
    "department": "MATH",
    "course_number": "432",
    "title": "Introduction to Topology",
    "description": "<b>Prerequisite:</b> Minimum grade of C- in MATH410.\nMetric spaces, topological spaces, connectedness, compactness (including Heine-Borel and Bolzano-Weierstrass theorems), Cantor sets, continuous maps and homeomorphisms, fundamental group (homotopy, covering spaces, the fundamental theorem of algebra, Brouwer fixed point theorem), surfaces (e.g., Euler characteristic, the index of a vector field, hairy sphere theorem), elements of combinatorial topology (graphs and trees, planarity, coloring problems).",
    "credits": 3,
    "professors": [
      "Joel Cohen",
      "Christian Zickert",
      "James Schafer",
      "Sarah Yeakel",
      "Harry Tamvakis"
    ],
    "average_gpa": 2.3193
  },
  {
    "department": "MATH",
    "course_number": "436",
    "title": "Differential Geometry of Curves and Surfaces I",
    "description": "<b>Prerequisite:</b> 1 course with a minimum grade of C- from (MATH241, MATH340); and 1 course with a minimum grade of C- from (MATH461, MATH240, MATH341); and must have completed two 400-level MATH courses with a minimum grade of C- (not including MATH461, 478, and 480's).\nCurves in the plane and Euclidean space, moving frames, surfaces in Euclidean space, orientability of surfaces; Gaussian and mean curvatures; surfaces of revolution, ruled surfaces, minimal surfaces, special curves on surfaces, \"Theorema Egregium\"; the intrinsic geometry of surfaces.",
    "credits": 3,
    "professors": [
      "Richard Wentworth",
      "Yanir Rubinstein",
      "Karin Melnick",
      "Allan Yashinski",
      "Terence Long",
      "Jonathan Rosenberg"
    ],
    "average_gpa": 3.00538
  },
  {
    "department": "MATH",
    "course_number": "437",
    "title": "Differential Forms",
    "description": "<b>Prerequisite:</b> 1 course with a minimum grade of C- from (MATH241, MATH340); and 1 course with a minimum grade of C- from (MATH240, MATH341, MATH461).\n<b>Recommended:</b> MATH405, MATH403, MATH436, MATH410, or MATH432.\nIntroduction to differential forms and their applications, and unites the fundamental theorems of multivariable calculus in a general Stokes Theorem that is valid in great generality. It develops this theory and technique to perform calculations in analysis and geometry. Topics include an introduction to topological spaces, the Gauss-Bonnet Theorem, Gauss's formula for the linking number, and the Cauchy Integral Theorem. Applications include Maxwell's equations of electromagnetism, connections and gauge theory, and symplectic geometry and Hamiltonian dynamics.",
    "credits": 3,
    "professors": [
      "Antoine Mellet",
      "William Goldman",
      "Hans-Joachim Hein",
      "James Schafer",
      "Sergei Novikov",
      "Steven Chadwick",
      "Richard Wentworth",
      "Tamas Darvas"
    ],
    "average_gpa": 2.80781
  },
  {
    "department": "MATH",
    "course_number": "445",
    "title": "Elementary Mathematical Logic",
    "description": "<b>Prerequisite:</b> Minimum grade of C- in MATH141.\nElementary development of propositional and predicate logic, including semantics and deductive systems and with a discussion of completeness, incompleteness and the decision problem.",
    "credits": 3,
    "professors": [
      "Justin Wyss-Gallifent",
      "Nathan Manning",
      "Caroline Terry",
      "Koushik Pal",
      "Roohollah Ebrahimian",
      "Samuel Braunfeld",
      "James Hanson"
    ],
    "average_gpa": 2.10321
  },
  {
    "department": "MATH",
    "course_number": "446",
    "title": "Axiomatic Set Theory",
    "description": "<b>Prerequisite:</b> 1 course with a minimum grade of C- from (MATH403, MATH410).\nDevelopment of a system of axiomatic set theory, choice principles, induction principles, ordinal arithmetic including discussion of cancellation laws, divisibility, canonical expansions, cardinal arithmetic including connections with the axiom of choice, Hartog's theorem, Konig's theorem, properties of regular, singular and inaccessible cardinals.",
    "credits": 3,
    "professors": [
      "Michael Laskowski",
      "David Kueker",
      "Caroline Terry",
      "Christopher Laskowski"
    ],
    "average_gpa": 2.98866
  },
  {
    "department": "MATH",
    "course_number": "452",
    "title": "Introduction to Dynamics and Chaos",
    "description": "<b>Prerequisite:</b> MATH341. Or MATH246; and (MATH240 or MATH461).  Also offered as: AMSC452.\n<b>Credit only granted for:</b> AMSC452 or MATH452.\nAn introduction to mathematical dynamics and chaos. Orbits, bifurcations, Cantor sets and horseshoes, symbolic dynamics, fractal dimension, notions of stability, flows and chaos. Includes motivation and historical perspectives, as well as examples of fundamental maps studied in dynamics and applications of dynamics.",
    "credits": 3,
    "professors": [
      "Giovanni Forni",
      "Kelly Yancey",
      "Denny Gulick",
      "Christian Rosendal",
      "Adam Kanigowski",
      "Rodrigo Trevino",
      "Dmitry Dolgopyat",
      "Agnieszka Zelerowicz"
    ],
    "average_gpa": 2.94109
  },
  {
    "department": "MATH",
    "course_number": "456",
    "title": "Cryptography",
    "description": "<b>Prerequisite:</b> (CMSC106, CMSC131, or ENEE150; or equivalent programming experience); and (2 courses from (CMSC330, CMSC351, ENEE324, or ENEE380); or any one of these courses and a 400-level MATH course, or two 400-level MATH courses). Or permission of instructor.  Also offered as: CMSC456, ENEE456.\n<b>Credit only granted for:</b> MATH456, CMSC456 or ENEE456.\nThe theory, application, and implementation of mathematical techniques used to secure modern communications. Topics include symmetric and public-key encryption, message integrity, hash functions, block-cipher design and analysis, number theory, and digital signatures.",
    "credits": 3,
    "professors": [
      "James Schafer",
      "Lawrence Washington",
      "Jonathan Katz",
      "Jonathan Rosenberg",
      "Jeffrey Adams",
      "Samuel Ranellucci",
      "William Gasarch",
      "Dana Dachman-Soled",
      "Nathan Manning",
      "Gorjan Alagic",
      "Charalampos Papamanthou",
      "Wiseley Wong"
    ],
    "average_gpa": 2.93548
  },
  {
    "department": "MATH",
    "course_number": "461",
    "title": "Linear Algebra for Scientists and Engineers",
    "description": "<b>Prerequisite:</b> Minimum grade of C- in MATH141; and must have completed any MATH or STAT course with a prerequisite of MATH141.\n<b>Credit only granted for:</b> MATH240, MATH341, or MATH461.\n<b>Additional information:</b> This course may not be used towards the upper level math requirements for MATH/STAT majors.\nBasic concepts of linear algebra. This course is similar to MATH 240, but with more extensive coverage of the topics needed in applied linear algebra: change of basis, complex eigenvalues, diagonalization, the Jordan canonical form.\n<i>All Sections will use MATLAB.</i>",
    "credits": 3,
    "professors": [
      "Melissa Macasieb",
      "Antoine Mellet",
      "Jeffrey Adams",
      "Raluca Rosca",
      "Benjamin Manning",
      "Konstantina Trivisa",
      "Tobias von Petersdorff",
      "Manoussos Grillakis",
      "Allan Yashinski",
      "Koushik Pal",
      "Kendall Williams",
      "Niranjan Ramachandran",
      "Javier Morales Delgado",
      "Stephen Balady",
      "Javier Morales Delgado",
      "Terence Long",
      "Fei Wang",
      "Jonathan Fernandes",
      "Samuel Braunfeld",
      "Giovanni Forni",
      "Xuemiao Chen",
      "Amin Gholampour",
      "Jermain McDermott",
      "Ruiwen Shu",
      "Matei Machedon",
      "Yordanka Kovacheva",
      "James Hanson"
    ],
    "average_gpa": 2.8004
  },
  {
    "department": "MATH",
    "course_number": "462",
    "title": "Partial Differential Equations",
    "description": "<b>Prerequisite:</b> 1 course with a minimum grade of C- from (MATH241, MATH340); and 1 course with a minimum grade of C- from (MATH246, MATH341).\nLinear spaces and operators, orthogonality, Sturm-Liouville problems and eigenfunction expansions for ordinary differential equations. Introduction to partial differential equations, including the heat equation, wave equation and Laplace's equation. Boundary value problems, initial value problems and initial-boundary value problems.",
    "credits": 3,
    "professors": [
      "Tobias von Petersdorff",
      "Antoine Mellet",
      "Ricardo Nochetto",
      "Manoussos Grillakis",
      "Benjamin Manning",
      "David Hamilton",
      "Jacob Bedrossian",
      "Giovanni Forni",
      "Dionisios Margetis",
      "Stuart Antman",
      "Matei Machedon",
      "Amin Gholampour",
      "Konstantina Trivisa",
      "Stefan Doboszczak",
      "Antonio De Rosa",
      "Kendall Williams"
    ],
    "average_gpa": 2.44092
  },
  {
    "department": "MATH",
    "course_number": "463",
    "title": "Complex Variables",
    "description": "<b>Prerequisite:</b> 1 course with a minimum grade of C- from (MATH241, MATH340).\nThe algebra of complex numbers, analytic functions, mapping properties of the elementary functions. Cauchy integral formula. Theory of residues and application to evaluation of integrals. Conformal mapping.",
    "credits": 3,
    "professors": [
      "David Hamilton",
      "Casey Cremins",
      "Michael Jakobson",
      "Radu Balan",
      "Raluca Rosca",
      "Antoine Mellet",
      "McBlaine Boyle",
      "Dionisios Margetis",
      "Patrick Fitzpatrick",
      "Vadim Kaloshin",
      "Manoussos Grillakis",
      "Richard Wentworth",
      "Horst Winkelnkemper",
      "Kasso Okoudjou",
      "Sandra Cerrai",
      "Allan Yashinski",
      "Amin Gholampour",
      "Samuel Braunfeld",
      "Terence Long",
      "Xuemiao Chen",
      "Sewon Yang"
    ],
    "average_gpa": 2.55602
  },
  {
    "department": "MATH",
    "course_number": "464",
    "title": "Transform Methods",
    "description": "<b>Prerequisite:</b> 1 course with a minimum grade of C- from (MATH246, MATH341).\nFourier transform, Fourier series, discrete fast Fourier transform (DFT and FFT). Laplace transform. Poisson summations, and sampling. Optional Topics: Distributions and operational calculus, PDEs, Wavelet transform, Radon transform and applications such as Imaging, Speech Processing, PDEs of Mathematical Physics, Communications, Inverse Problems.",
    "credits": 3,
    "professors": [
      "Radu Balan",
      "Doron Levy",
      "Kasso Okoudjou",
      "Wojciech Czaja",
      "Stuart Antman",
      "Tobias von Petersdorff",
      "Vadim Kaloshin",
      "Todd Rowland"
    ],
    "average_gpa": 2.27824
  },
  {
    "department": "MATH",
    "course_number": "470",
    "title": "Mathematics for Secondary Education",
    "description": "<b>Prerequisite:</b> MATH141 and MATH140; and must have completed one 400-level MATH course (not to include MATH461, 478, and 480's).\nAn advanced perspective on some of the core mathematics underlying high school mathematics courses. Topics include number systems, functions of one variable, equations, inequalities, trigonometric functions, curve fitting, and polynomials. The course includes an analysis of alternate approaches to mathematical ideas and problems, and makes connections between ideas that may have been studied separately in different high school and college courses.",
    "credits": 3,
    "professors": [
      "Catherine VanNetta",
      "Elizabeth Wilson",
      "Frances Gulick",
      "Dana Grosser-Clarkson"
    ],
    "average_gpa": 3.44317
  },
  {
    "department": "MATH",
    "course_number": "475",
    "title": "Combinatorics and Graph Theory",
    "description": "<b>Prerequisite:</b> 1 course with a minimum grade of C- from (MATH240, MATH341, MATH461); and 1 course with a minimum grade of C- from (MATH241, MATH340); and permission of CMNS-Mathematics department. Cross-listed with CMSC475.\n<b>Credit only granted for:</b> MATH475 or CMSC475.\nGeneral enumeration methods, difference equations, generating functions. Elements of graph theory, matrix representations of graphs, applications of graph theory to transport networks, matching theory and graphical algorithms.",
    "credits": 3,
    "professors": [
      "Jeffrey Adams",
      "Wiseley Wong",
      "Elizabeth Wilson",
      "Roohollah Ebrahimian",
      "Samuel Braunfeld",
      "Anthony Ostuni"
    ],
    "average_gpa": 2.69156
  },
  {
    "department": "MATH",
    "course_number": "478A",
    "title": "Selected Topics For Teachers of Mathematics",
    "description": null,
    "credits": 1,
    "professors": [],
    "average_gpa": null
  },
  {
    "department": "MATH",
    "course_number": "480",
    "title": null,
    "description": null,
    "credits": null,
    "professors": [],
    "average_gpa": 3.72143
  },
  {
    "department": "MATH",
    "course_number": "481",
    "title": null,
    "description": null,
    "credits": null,
    "professors": ["Richard Hollenbeck", "Janet Walkoe"],
    "average_gpa": 3.5449
  },
  {
    "department": "MATH",
    "course_number": "482",
    "title": null,
    "description": null,
    "credits": null,
    "professors": ["Karen McLaren"],
    "average_gpa": 3.72778
  },
  {
    "department": "MATH",
    "course_number": "487",
    "title": null,
    "description": null,
    "credits": null,
    "professors": [],
    "average_gpa": 3.61829
  },
  {
    "department": "MATH",
    "course_number": "489",
    "title": "Research Interactions in Mathematics; Research Interactions in Mathematics",
    "description": null,
    "credits": 1,
    "professors": [],
    "average_gpa": null
  },
  {
    "department": "MATH",
    "course_number": "498",
    "title": "Selected Topics in Mathematics",
    "description": null,
    "credits": 1,
    "professors": ["Doron Levy", "Jacob Bedrossian"],
    "average_gpa": null
  },
  {
    "department": "MATH",
    "course_number": "498A",
    "title": "Selected Topics in Mathematics",
    "description": null,
    "credits": 1,
    "professors": [],
    "average_gpa": null
  },
  {
    "department": "MATH",
    "course_number": "498K",
    "title": null,
    "description": null,
    "credits": null,
    "professors": ["Janet Walkoe", "Karen McLaren"],
    "average_gpa": 3.31515
  },
  {
    "department": "MATH",
    "course_number": "600",
    "title": "Abstract Algebra I",
    "description": "<b>Prerequisite:</b> MATH405 and MATH403; or students who have taken courses with comparable content may contact the department.\nGroups with operators, homomorphism and isomorphism theorems, normal series, Sylow theorems, free groups, Abelian groups, rings, integral domains, fields, modules. Topics may include HOM (A,B), Tensor products, exterior algebra.\n<i>Offered fall only.</i>",
    "credits": 3,
    "professors": [
      "Niranjan Ramachandran",
      "Jonathan Rosenberg",
      "James Schafer",
      "Thomas Haines",
      "Harry Tamvakis",
      "Amin Gholampour",
      "Xuhua He",
      "Jeffrey Adams"
    ],
    "average_gpa": 3.1748
  },
  {
    "department": "MATH",
    "course_number": "601",
    "title": "Abstract Algebra II",
    "description": "<b>Prerequisite:</b> MATH600.\nField theory, Galois theory, multilinear algebra. Further topics from: Dedekind domains, Noetherian domains, rings with minimum condition, homological algebra.\n<i>Offered Spring only.</i>",
    "credits": 3,
    "professors": [
      "James Schafer",
      "Niranjan Ramachandran",
      "Jonathan Rosenberg",
      "Thomas Haines",
      "Harry Tamvakis",
      "Amin Gholampour",
      "Xuhua He",
      "Jeffrey Adams"
    ],
    "average_gpa": 3.58302
  },
  {
    "department": "MATH",
    "course_number": "602",
    "title": "Homological Algebra",
    "description": "<b>Prerequisite:</b> MATH600.\nProjective and injective modules, homological dimensions, derived functors, spectral sequence of a composite functor. Applications.",
    "credits": 3,
    "professors": ["Patrick Brosnan", "James Schafer"],
    "average_gpa": 3.50238
  },
  {
    "department": "MATH",
    "course_number": "603",
    "title": "Commutative Algebra",
    "description": "<b>Prerequisite:</b> MATH600.\nIdeal theory of Noetherian rings, valuations, localizations, complete local rings, Dedekind domains.",
    "credits": 3,
    "professors": [
      "James Schafer",
      "Amin Gholampour",
      "Jonathan Rosenberg",
      "Patrick Brosnan"
    ],
    "average_gpa": 3.92188
  },
  {
    "department": "MATH",
    "course_number": "606",
    "title": "Algebraic Geometry I",
    "description": "<b>Prerequisite:</b> MATH600 and MATH601.\nPrime and primary ideals in Noetherian rings, Hilbert Nullstellensatz, places and valuations, prevarieties (in the sense of Serre), dimension, morphisms, singularities, varieties, schemes, rationality.",
    "credits": 3,
    "professors": [
      "Patrick Brosnan",
      "Amin Gholampour",
      "Thomas Haines",
      "Harry Tamvakis"
    ],
    "average_gpa": 3.8
  },
  {
    "department": "MATH",
    "course_number": "607",
    "title": "Algebraic Geometry II",
    "description": "<b>Prerequisite:</b> MATH606.\nTopics in contemporary algebraic geometry chosen from among: theory of algebraic curves and surfaces, elliptic curves, Abelian varieties, theory of schemes, theory of zeta functions, formal cohomology, algebraic groups, reduction theory.",
    "credits": 3,
    "professors": [
      "Amin Gholampour",
      "Thomas Haines",
      "Harry Tamvakis",
      "Yordanka Kovacheva"
    ],
    "average_gpa": 3.78864
  },
  {
    "department": "MATH",
    "course_number": "608A",
    "title": null,
    "description": null,
    "credits": null,
    "professors": [],
    "average_gpa": null
  },
  {
    "department": "MATH",
    "course_number": "608E",
    "title": null,
    "description": null,
    "credits": null,
    "professors": ["Patrick Brosnan"],
    "average_gpa": 4.0
  },
  {
    "department": "MATH",
    "course_number": "608F",
    "title": null,
    "description": null,
    "credits": null,
    "professors": ["Amin Gholampour"],
    "average_gpa": null
  },
  {
    "department": "MATH",
    "course_number": "608J",
    "title": null,
    "description": null,
    "credits": null,
    "professors": ["Patrick Brosnan"],
    "average_gpa": 4.0
  },
  {
    "department": "MATH",
    "course_number": "608P",
    "title": null,
    "description": null,
    "credits": null,
    "professors": ["Thomas Haines"],
    "average_gpa": 4.0
  },
  {
    "department": "MATH",
    "course_number": "608R",
    "title": null,
    "description": null,
    "credits": null,
    "professors": ["William Gasarch"],
    "average_gpa": null
  },
  {
    "department": "MATH",
    "course_number": "620",
    "title": "Algebraic Number Theory I",
    "description": "<b>Prerequisite:</b> MATH601.\nAlgebraic numbers and algebraic integers, algebraic number fields of finite degree, ideals and units, fundamental theorem of algebraic number theory, theory of residue classes, Minkowski's theorem on linear forms, class numbers, Dirichlet's theorem on units, relative algebraic number fields, decomposition group, inertia group and ramification group of prime ideals with respect to a relatively Galois extension.",
    "credits": 3,
    "professors": ["Lawrence Washington", "Niranjan Ramachandran"],
    "average_gpa": 3.97778
  },
  {
    "department": "MATH",
    "course_number": "621",
    "title": "Algebraic Number Theory II",
    "description": "<b>Prerequisite:</b> MATH600. And MATH620; or students who have taken courses with comparable content may contact the department.\nValuation of a field, algebraic function fields, completion of a valuation field, ramification exponent and residue class degree, ramification theory, elements, differents, discriminants, product formula and characterization of fields by the formula, Gauss sum, class number formula of cyclotomic fields.",
    "credits": 3,
    "professors": ["Niranjan Ramachandran", "Yihang Zhu"],
    "average_gpa": 3.95
  },
  {
    "department": "MATH",
    "course_number": "630",
    "title": "Real Analysis I",
    "description": "<b>Prerequisite:</b> MATH411; or students who have taken courses with comparable content may contact the department.\nLebesgue measure and the Lebesgue integral on R, differentiation of functions of bounded variation, absolute continuity and fundamental theorem of calculus, Lp spaces on R, Riesz-Fischer theorem, bounded linear functionals on Lp, measure and outer measure, Fubini's theorem.",
    "credits": 3,
    "professors": [
      "Kasso Okoudjou",
      "Patrick Fitzpatrick",
      "Wojciech Czaja",
      "Radu Balan"
    ],
    "average_gpa": 3.17739
  },
  {
    "department": "MATH",
    "course_number": "631",
    "title": "Real Analysis II",
    "description": "<b>Prerequisite:</b> MATH630.\nAbstract measure and integration theory, metric spaces, Baire category theorem and uniform boundedness principle, Radon-Nikodym theorem, Riesz Representation theorem, Lebesgue decomposition, Banach and Hilbert Spaces, Banach-Steinhaus theorem, topological spaces, Arzela-Ascoli and Stone-Weierstrass theorems, compact sets and Tychonoff's theorem.\n<i>Offered Spring only.</i>",
    "credits": 3,
    "professors": [
      "Patrick Fitzpatrick",
      "Kasso Okoudjou",
      "Wojciech Czaja",
      "Radu Balan"
    ],
    "average_gpa": 3.45581
  },
  {
    "department": "MATH",
    "course_number": "632",
    "title": "Functional Analysis",
    "description": "<b>Prerequisite:</b> MATH631.\nIntroduction to functional analysis and operator theory: normed linear spaces, basic principles of functional analysis, bounded linear operators on Hilbert spaces, spectral theory of selfadjoint operators, applications to differential and integral equations, additional topics as time permits.",
    "credits": 3,
    "professors": ["Patrick Fitzpatrick", "Jonathan Rosenberg", "Radu Balan"],
    "average_gpa": 3.65263
  },
  {
    "department": "MATH",
    "course_number": "634",
    "title": "Harmonic Analysis",
    "description": "<b>Prerequisite:</b> MATH630.\nL1 theory: Fejer theorem, inversion theorem, ideal structure, Tauberian theorem. L2 theory: Plancherel-Parseval theorems, Paley-Wiener theorem. Lp theory: Hausdorff-Young theorem. Distribution theory: Bochner's theorem, Wiener continuous measures theorem, Malliavin theorem, Schwartz theory, almost periodic functions.",
    "credits": 3,
    "professors": ["John Benedetto", "Radu Balan"],
    "average_gpa": 3.61957
  },
  {
    "department": "MATH",
    "course_number": "636",
    "title": "Representation Theory",
    "description": "<b>Prerequisite:</b> MATH631.\nIntroduction to representation theory of Lie groups and Lie algebras; initiation into non-abelian harmonic analysis through a detailed study of the most basic examples, such as unitary and orthogonal groups, the Heisenberg group, Euclidean motion groups, the special linear group. Additional topics from the theory of nilpotent Lie groups, semisimple Lie groups, p-adic groups or C-algebras.",
    "credits": 3,
    "professors": ["Jeffrey Adams"],
    "average_gpa": 3.61304
  },
  {
    "department": "MATH",
    "course_number": "642",
    "title": "Dynamical Systems I",
    "description": "<b>Prerequisite:</b> MATH432. And MATH630; or students who have taken courses with comparable content may contact the department.\nFoundations of topological dynamics, homeomorphisms, flows, periodic and recurrent points, transitivity and minimality, symbolic dynamics. Elements of ergodic theory, invariant measures and sets, ergodicity, ergodic theorems, mixing, spectral theory, flows and sections. Applications of dynamical systems to number theory, the Weyl theorem, the distribution of values of polynomials, Vander Waerden's theorem on arithmetic progressions.",
    "credits": 3,
    "professors": [
      "William Goldman",
      "Giovanni Forni",
      "Dmitry Dolgopyat",
      "Michael Jakobson",
      "Rodrigo Trevino",
      "Adam Kanigowski"
    ],
    "average_gpa": 3.71094
  },
  {
    "department": "MATH",
    "course_number": "643",
    "title": "Dynamical Systems II",
    "description": "Entropy theory, variational principle for the entropy, expansiveness, measures with maximal entropy. Smooth systems on manifolds, diffeomorphisms and flows, periodic points, stable and unstable manifolds, homoclinic points, transversality, the Krupka-Smale theorem, Morse-Smale systems. Hyperbolicity, Anosov systems, distributions and foliations, strange attractors, Bowen's measure.",
    "credits": 3,
    "professors": ["Dmitry Dolgopyat", "Vadim Kaloshin", "Rodrigo Trevino"],
    "average_gpa": 4.0
  },
  {
    "department": "MATH",
    "course_number": "648A",
    "title": null,
    "description": null,
    "credits": null,
    "professors": [],
    "average_gpa": null
  },
  {
    "department": "MATH",
    "course_number": "648I",
    "title": null,
    "description": null,
    "credits": null,
    "professors": ["Wojciech Czaja"],
    "average_gpa": 3.81818
  },
  {
    "department": "MATH",
    "course_number": "648J",
    "title": null,
    "description": null,
    "credits": null,
    "professors": ["John Benedetto"],
    "average_gpa": 3.41818
  },
  {
    "department": "MATH",
    "course_number": "648M",
    "title": null,
    "description": null,
    "credits": null,
    "professors": ["Manoussos Grillakis", "Dionisios Margetis"],
    "average_gpa": 3.69375
  },
  {
    "department": "MATH",
    "course_number": "648P",
    "title": null,
    "description": null,
    "credits": null,
    "professors": ["Michael Jakobson"],
    "average_gpa": 3.925
  },
  {
    "department": "MATH",
    "course_number": "648Q",
    "title": null,
    "description": null,
    "credits": null,
    "professors": ["Wojciech Czaja"],
    "average_gpa": 4.0
  },
  {
    "department": "MATH",
    "course_number": "660",
    "title": "Complex Analysis I",
    "description": "<b>Prerequisite:</b> MATH410; or students who have taken courses with comparable content may contact the department.\nLinear transformations, analytic functions, conformal mappings, Cauchy's theorem and applications, power series, partial fractions and factorization, elementary Riemann surfaces, Riemann's mapping theorem.",
    "credits": 3,
    "professors": [
      "Richard Wentworth",
      "Giovanni Forni",
      "Michael Jakobson",
      "Scott Wolpert",
      "Harry Tamvakis"
    ],
    "average_gpa": 3.30828
  },
  {
    "department": "MATH",
    "course_number": "661",
    "title": "Complex Analysis II",
    "description": "<b>Prerequisite:</b> MATH630 and MATH660.\nIntroduction to techniques of several complex variables, with focus on geometric topics: Hartogs phenomena, Cousin problems, Dolbeault cohomology, L2 techniques, embedding of Stein manifolds, and the theory of coherent analytic sheaves.",
    "credits": 3,
    "professors": ["Scott Wolpert", "Tamas Darvas"],
    "average_gpa": 4.0
  },
  {
    "department": "MATH",
    "course_number": "668A",
    "title": null,
    "description": null,
    "credits": null,
    "professors": [],
    "average_gpa": null
  },
  {
    "department": "MATH",
    "course_number": "669",
    "title": "Selected Topics in Riemann Surfaces",
    "description": null,
    "credits": 1,
    "professors": ["Richard Wentworth", "Giovanni Forni"],
    "average_gpa": 3.42857
  },
  {
    "department": "MATH",
    "course_number": "670",
    "title": "Ordinary Differential Equations I",
    "description": "<b>Prerequisite:</b> MATH405. And MATH410; or students who have taken courses with comparable content may contact the department.  Cross-listed with A MSC670.\n<b>Credit only granted for:</b> AMSC670 or MATH670.\nExistence and uniqueness, linear systems usually with Floquet theory for periodic systems, linearization and stability, planar systems usually with Poincare-Bendixson theorem.",
    "credits": 3,
    "professors": [
      "Vadim Kaloshin",
      "Giovanni Forni",
      "Dmitry Dolgopyat",
      "Michael Jakobson"
    ],
    "average_gpa": 2.94667
  },
  {
    "department": "MATH",
    "course_number": "671",
    "title": "Ordinary Differential Equations II",
    "description": "The content of this course varies with the interests of the instructor and the class. Stability theory, control, time delay systems, Hamiltonian systems, bifurcation theory, and boundary value problems, and the like.",
    "credits": 3,
    "professors": ["Michael Jakobson", "Vadim Kaloshin", "Dmitry Dolgopyat"],
    "average_gpa": 1.5
  },
  {
    "department": "MATH",
    "course_number": "673",
    "title": "Partial Differential Equations I",
    "description": "<b>Prerequisite:</b> MATH411; or students who have taken courses with comparable content may contact the department.  Cross-listed with AMSC67 3.\n<b>Credit only granted for:</b> AMSC673 or MATH673.\nAnalysis of boundary value problems for Laplace's equation, initial value problems for the heat and wave equations. Fundamental solutions, maximum principles, energy methods. First order nonlinear PDE, conservation laws. Characteristics, shock formation, weak solutions. Distributions, Fourier transform.\n<i>Offered fall only.</i>",
    "credits": 3,
    "professors": [
      "Pierre-Emmanuel Jabin",
      "Matei Machedon",
      "Ricardo Nochetto",
      "Jacob Bedrossian",
      "Konstantina Trivisa",
      "Manoussos Grillakis",
      "Dionisios Margetis"
    ],
    "average_gpa": 2.97069
  },
  {
    "department": "MATH",
    "course_number": "674",
    "title": "Partial Differential Equations II",
    "description": "<b>Prerequisite:</b> MATH673 or AMSC673; or permission of instructor.  Also offered as: AMSC674.\n<b>Credit only granted for:</b> AMSC674 or MATH674.\nBoundary value problems for elliptic partial differential equations via operator-theoretic methods. Hilbert spaces of functions. Duality, weak convergence. Sobolev spaces. Spectral theory of compact operators. Eigenfunction expansions.\n<i>Offered Spring only.</i>",
    "credits": 3,
    "professors": [
      "Matei Machedon",
      "Pierre-Emmanuel Jabin",
      "Jacob Bedrossian",
      "Konstantina Trivisa",
      "Manoussos Grillakis"
    ],
    "average_gpa": 3.37176
  },
  {
    "department": "MATH",
    "course_number": "689",
    "title": "Research Interactions in Mathematics",
    "description": null,
    "credits": 1,
    "professors": [],
    "average_gpa": 4.0
  },
  {
    "department": "MATH",
    "course_number": "689A",
    "title": "Research Interactions in Mathematics; Mathematical Concepts and Practices",
    "description": null,
    "credits": 1,
    "professors": ["Thomas Haines"],
    "average_gpa": 4.0
  },
  {
    "department": "MATH",
    "course_number": "695",
    "title": "Teaching Seminar",
    "description": "<b>Restriction:</b> Must be in one of the following programs (Mathematics (Doctoral); Mathematics (Master's); Mathematical Statistics (Doctoral); Applied Mathematics and Scientific Computation (Master's); Mathematical Statistics (Master's); Applied Mathematics and Scientific Computation (Doctoral)).\nA course intended for first year teaching assistants. Topics include: everyday mechanics of teaching; teaching methods and styles; technology; course enrichment, diversity in the classroom; sexual harassment; teacher-student interactions; presentations by students.",
    "credits": 1,
    "professors": ["Justin Wyss-Gallifent", "Terence Long"],
    "average_gpa": 3.86981
  },
  {
    "department": "MATH",
    "course_number": "712",
    "title": "Mathematical Logic I",
    "description": "Sentential logic, first-order languages, models and formal deductions. Basic model theory including completeness and compactness theorems, other methods of constructing models, and applications such as non-standard analysis.",
    "credits": 3,
    "professors": ["Michael Laskowski", "Samuel Braunfeld"],
    "average_gpa": 3.09167
  },
  {
    "department": "MATH",
    "course_number": "713",
    "title": "Mathematical Logic II",
    "description": "<b>Prerequisite:</b> MATH712.\nIncompleteness and undecidability results of Godel, Church, Tarski and others. Recursive function. Basic proof theory and axiomatic set theory.",
    "credits": 3,
    "professors": ["Michael Laskowski", "David Kueker", "Christian Rosendal"],
    "average_gpa": 3.55
  },
  {
    "department": "MATH",
    "course_number": "718A",
    "title": null,
    "description": null,
    "credits": null,
    "professors": [],
    "average_gpa": 4.0
  },
  {
    "department": "MATH",
    "course_number": "718M",
    "title": null,
    "description": null,
    "credits": null,
    "professors": ["Michael Laskowski"],
    "average_gpa": null
  },
  {
    "department": "MATH",
    "course_number": "730",
    "title": "Fundamental Concepts of Topology",
    "description": "<b>Prerequisite:</b> MATH403, MATH410, and MATH411; or students who have taken courses with comparable content may contact the department.\nSurvey of basic point set topology, fundamental group, covering spaces, Van Kampen's theorem, simplicial complexes, simplicial homology, Euler characteristics and classification of surfaces.",
    "credits": 3,
    "professors": [
      "Christian Zickert",
      "Joel Cohen",
      "Jonathan Rosenberg",
      "Steve Halperin",
      "Sarah Yeakel",
      "Karin Melnick"
    ],
    "average_gpa": 3.15455
  },
  {
    "department": "MATH",
    "course_number": "734",
    "title": "Algebraic Topology",
    "description": "<b>Prerequisite:</b> MATH403; or students who have taken courses with comparable content may contact the department.\n<b>Recommended:</b> MATH730.\nSingular homology and cohomology, cup products, Poincare duality, Eilenberg-Steenrod axioms, Whitehead and Hurewicz theorems, universal coefficient theorem, cellular homology.",
    "credits": 3,
    "professors": [
      "Joel Cohen",
      "James Schafer",
      "Steve Halperin",
      "Sergei Novikov",
      "Christian Zickert",
      "William Goldman",
      "Jonathan Rosenberg"
    ],
    "average_gpa": 3.50159
  },
  {
    "department": "MATH",
    "course_number": "740",
    "title": "Fundamental Concepts of Differential Geometry",
    "description": "<b>Prerequisite:</b> MATH405, MATH411, and MATH730; or students who have taken courses with comparable content may contact the department.\nManifolds, tangent vectors and differential forms, Riemannian metrics, connections, curvature, structure equations, geodesics, calculus of variations.",
    "credits": 3,
    "professors": [
      "Jonathan Rosenberg",
      "William Goldman",
      "Richard Wentworth",
      "Sergei Novikov",
      "Tamas Darvas",
      "Karin Melnick"
    ],
    "average_gpa": 3.55657
  },
  {
    "department": "MATH",
    "course_number": "742",
    "title": "Geometric Analysis",
    "description": "<b>Prerequisite:</b> MATH673 and MATH674; or MATH740.\nCalculus of Variations, Bochner technique, Morse theory, weak solutions and elliptic regularity, maximum principle for elliptic and parabolic equations, Green's function of the Laplacian, isoperimetric and Sobolev inequalities, continuity method, curvature and comparison results, harmonic maps, curvature prescription problems.",
    "credits": 3,
    "professors": [
      "Yanir Rubinstein",
      "Hans-Joachim Hein",
      "Sergei Novikov",
      "Pierre-Emmanuel Jabin",
      "Karin Melnick",
      "Tamas Darvas",
      "Daniel Cristofaro-Gardiner"
    ],
    "average_gpa": 3.83462
  },
  {
    "department": "MATH",
    "course_number": "744",
    "title": "Lie Groups I",
    "description": "<b>Prerequisite:</b> MATH405, MATH403, MATH411, and MATH432; or students who have taken courses with comparable content may contact the department.\nAn introduction to the fundamentals of Lie groups, including some material on groups of matrices and Lie algebras.",
    "credits": 3,
    "professors": [
      "Jeffrey Adams",
      "Karin Melnick",
      "Richard Wentworth",
      "William Goldman"
    ],
    "average_gpa": 3.73265
  },
  {
    "department": "MATH",
    "course_number": "748A",
    "title": null,
    "description": null,
    "credits": null,
    "professors": [],
    "average_gpa": null
  },
  {
    "department": "MATH",
    "course_number": "748F",
    "title": null,
    "description": null,
    "credits": null,
    "professors": ["Yanir Rubinstein"],
    "average_gpa": 3.6
  },
  {
    "department": "MATH",
    "course_number": "748R",
    "title": null,
    "description": null,
    "credits": null,
    "professors": ["Jonathan Rosenberg"],
    "average_gpa": 3.6
  },
  {
    "department": "MATH",
    "course_number": "799",
    "title": "Master's Thesis Research",
    "description": null,
    "credits": 1,
    "professors": [],
    "average_gpa": null
  },
  {
    "department": "MATH",
    "course_number": "808A",
    "title": "Selected Topics in Algebra",
    "description": null,
    "credits": 1,
    "professors": [],
    "average_gpa": null
  },
  {
    "department": "MATH",
    "course_number": "808B",
    "title": null,
    "description": null,
    "credits": null,
    "professors": ["Harry Tamvakis"],
    "average_gpa": 4.0
  },
  {
    "department": "MATH",
    "course_number": "808C",
    "title": "Selected Topics in Algebra; Galois and Etale Cohomology",
    "description": null,
    "credits": 1,
    "professors": ["Patrick Brosnan", "Niranjan Ramachandran"],
    "average_gpa": 4.0
  },
  {
    "department": "MATH",
    "course_number": "808D",
    "title": null,
    "description": null,
    "credits": null,
    "professors": ["Swarnava Mukhopadhyay"],
    "average_gpa": 4.0
  },
  {
    "department": "MATH",
    "course_number": "808E",
    "title": null,
    "description": null,
    "credits": null,
    "professors": ["Patrick Brosnan"],
    "average_gpa": 4.0
  },
  {
    "department": "MATH",
    "course_number": "808F",
    "title": "Selected Topics in Algebra; Representations of Hecke Algebras",
    "description": null,
    "credits": 1,
    "professors": ["Niranjan Ramachandran", "Jingren Chi", "Thomas Haines"],
    "average_gpa": 3.88571
  },
  {
    "department": "MATH",
    "course_number": "808G",
    "title": "Selected Topics in Algebra; INTRODUCTION TO STACKS",
    "description": null,
    "credits": 1,
    "professors": [
      "Amin Gholampour",
      "Huanchen Bao",
      "Harry Tamvakis",
      "Thomas Haines"
    ],
    "average_gpa": 4.0
  },
  {
    "department": "MATH",
    "course_number": "808I",
    "title": "Selected Topics in Algebra; .Moduli of Vector Bundles",
    "description": null,
    "credits": 1,
    "professors": ["Michael Rapoport"],
    "average_gpa": null
  },
  {
    "department": "MATH",
    "course_number": "808J",
    "title": "Selected Topics in Algebra; Moduli of Elliptic Curves",
    "description": null,
    "credits": 1,
    "professors": ["Michael Rapoport"],
    "average_gpa": 3.8
  },
  {
    "department": "MATH",
    "course_number": "808K",
    "title": "Selected Topics in Algebra; Brauer Groups",
    "description": null,
    "credits": 1,
    "professors": ["Patrick Brosnan", "Jonathan Rosenberg", "Eoin Mackall"],
    "average_gpa": 3.82222
  },
  {
    "department": "MATH",
    "course_number": "808L",
    "title": "Selected Topics in Algebra; Elliptic Curves",
    "description": null,
    "credits": 1,
    "professors": ["Lawrence Washington"],
    "average_gpa": 3.2
  },
  {
    "department": "MATH",
    "course_number": "808M",
    "title": "Selected Topics in Algebra; Arithmetic of Modular Curves",
    "description": null,
    "credits": 1,
    "professors": ["Swarnava Mukhopadhyay", "Thomas Haines"],
    "average_gpa": 4.0
  },
  {
    "department": "MATH",
    "course_number": "808N",
    "title": null,
    "description": null,
    "credits": null,
    "professors": ["Lawrence Washington"],
    "average_gpa": 4.0
  },
  {
    "department": "MATH",
    "course_number": "808P",
    "title": "Selected Topics in Algebra; P-Adic Representation Theor",
    "description": null,
    "credits": 1,
    "professors": ["Xuhua He"],
    "average_gpa": null
  },
  {
    "department": "MATH",
    "course_number": "808Q",
    "title": "Selected Topics in Algebra; Abelian Varieties",
    "description": null,
    "credits": 1,
    "professors": ["Niranjan Ramachandran"],
    "average_gpa": null
  },
  {
    "department": "MATH",
    "course_number": "808R",
    "title": null,
    "description": null,
    "credits": null,
    "professors": ["Xuhua He"],
    "average_gpa": 4.0
  },
  {
    "department": "MATH",
    "course_number": "808S",
    "title": null,
    "description": null,
    "credits": null,
    "professors": ["Thomas Haines"],
    "average_gpa": 3.88
  },
  {
    "department": "MATH",
    "course_number": "808T",
    "title": null,
    "description": null,
    "credits": null,
    "professors": ["Thomas Haines"],
    "average_gpa": 4.0
  },
  {
    "department": "MATH",
    "course_number": "808V",
    "title": "Selected Topics in Algebra; Shimura Varieties",
    "description": null,
    "credits": 1,
    "professors": ["Yihang Zhu"],
    "average_gpa": null
  },
  {
    "department": "MATH",
    "course_number": "808W",
    "title": "Selected Topics in Algebra; Scissors Congruence, Spectral Sequences, and Group Homology",
    "description": null,
    "credits": 1,
    "professors": ["Christian Zickert"],
    "average_gpa": null
  },
  {
    "department": "MATH",
    "course_number": "808Z",
    "title": null,
    "description": null,
    "credits": null,
    "professors": ["Niranjan Ramachandran"],
    "average_gpa": 4.0
  },
  {
    "department": "MATH",
    "course_number": "818A",
    "title": "Selected Topics in Logic",
    "description": null,
    "credits": 1,
    "professors": [],
    "average_gpa": null
  },
  {
    "department": "MATH",
    "course_number": "818C",
    "title": null,
    "description": null,
    "credits": null,
    "professors": ["Michael Laskowski"],
    "average_gpa": 4.0
  },
  {
    "department": "MATH",
    "course_number": "848A",
    "title": "Selected Topics in Geometry and Topology",
    "description": null,
    "credits": 1,
    "professors": [],
    "average_gpa": null
  },
  {
    "department": "MATH",
    "course_number": "848B",
    "title": null,
    "description": null,
    "credits": null,
    "professors": [],
    "average_gpa": null
  },
  {
    "department": "MATH",
    "course_number": "848C",
    "title": "Selected Topics in Geometry and Topology; Geometric Structures",
    "description": null,
    "credits": 1,
    "professors": ["William Goldman"],
    "average_gpa": 3.8
  },
  {
    "department": "MATH",
    "course_number": "848D",
    "title": "Selected Topics in Geometry and Topology; Riemann Surfaces",
    "description": null,
    "credits": 1,
    "professors": ["William Goldman"],
    "average_gpa": 4.0
  },
  {
    "department": "MATH",
    "course_number": "848E",
    "title": "Selected Topics in Geometry and Topology; Scissors Congruence and Invariants of 3-Manifolds",
    "description": null,
    "credits": 1,
    "professors": ["Christian Zickert"],
    "average_gpa": 3.28571
  },
  {
    "department": "MATH",
    "course_number": "848F",
    "title": "Selected Topics in Geometry and Topology; Holomorophic Bundles on Kaehler Manifolds",
    "description": null,
    "credits": 3,
    "professors": ["Richard Wentworth"],
    "average_gpa": 4.0
  },
  {
    "department": "MATH",
    "course_number": "848G",
    "title": "Selected Topics in Geometry and Topology; Topics of Geometric Analysis",
    "description": null,
    "credits": 1,
    "professors": ["William Goldman", "Yanir Rubinstein", "Jonathan Rosenberg"],
    "average_gpa": 3.86364
  },
  {
    "department": "MATH",
    "course_number": "848I",
    "title": "Selected Topics in Geometry and Topology; Exterior Differential Systems",
    "description": null,
    "credits": 1,
    "professors": ["Karin Melnick"],
    "average_gpa": 4.0
  },
  {
    "department": "MATH",
    "course_number": "848K",
    "title": null,
    "description": null,
    "credits": null,
    "professors": ["Vadim Kaloshin"],
    "average_gpa": 4.0
  },
  {
    "department": "MATH",
    "course_number": "848L",
    "title": "Selected Topics in Geometry and Topology; Sympletic Geometry",
    "description": null,
    "credits": 1,
    "professors": ["Daniel Cristofaro-Gardiner"],
    "average_gpa": null
  },
  {
    "department": "MATH",
    "course_number": "848M",
    "title": null,
    "description": null,
    "credits": null,
    "professors": ["Karin Melnick"],
    "average_gpa": 4.0
  },
  {
    "department": "MATH",
    "course_number": "848R",
    "title": "Selected Topics in Geometry and Topology; Dynamics on Moduli Spaces",
    "description": null,
    "credits": 1,
    "professors": ["William Goldman"],
    "average_gpa": 3.5
  },
  {
    "department": "MATH",
    "course_number": "848S",
    "title": "Selected Topics in Geometry and Topology; Topics in Differential Geometry",
    "description": null,
    "credits": 1,
    "professors": ["Yanir Rubinstein"],
    "average_gpa": null
  },
  {
    "department": "MATH",
    "course_number": "848T",
    "title": "Selected Topics in Geometry and Topology; Scissors congruence, spectral sequences, Hilbert's third problem",
    "description": null,
    "credits": 1,
    "professors": ["Christian Zickert"],
    "average_gpa": 4.0
  },
  {
    "department": "MATH",
    "course_number": "848W",
    "title": null,
    "description": null,
    "credits": null,
    "professors": ["Richard Wentworth"],
    "average_gpa": 3.8
  },
  {
    "department": "MATH",
    "course_number": "848X",
    "title": "Selected Topics in Geometry and Topology; Homotopy Theory and Characteristic Classics",
    "description": null,
    "credits": 3,
    "professors": ["Jonathan Rosenberg"],
    "average_gpa": 4.0
  },
  {
    "department": "MATH",
    "course_number": "848Y",
    "title": "Selected Topics in Geometry and Topology; Topics in Differential Geometry",
    "description": null,
    "credits": 1,
    "professors": ["Yanir Rubinstein"],
    "average_gpa": 4.0
  },
  {
    "department": "MATH",
    "course_number": "848Z",
    "title": null,
    "description": null,
    "credits": null,
    "professors": ["Christian Zickert"],
    "average_gpa": 4.0
  },
  {
    "department": "MATH",
    "course_number": "858A",
    "title": "Selected Topics in Analysis",
    "description": null,
    "credits": 1,
    "professors": [],
    "average_gpa": 3.58
  },
  {
    "department": "MATH",
    "course_number": "858B",
    "title": null,
    "description": null,
    "credits": null,
    "professors": ["Stuart Antman"],
    "average_gpa": null
  },
  {
    "department": "MATH",
    "course_number": "858C",
    "title": null,
    "description": null,
    "credits": null,
    "professors": ["Wojciech Czaja"],
    "average_gpa": 4.0
  },
  {
    "department": "MATH",
    "course_number": "858D",
    "title": "Selected Topics in Analysis; Mathematical Analysis of Fluid Mechanics",
    "description": null,
    "credits": 1,
    "professors": ["Maria Cameron", "Jacob Bedrossian", "Radu Balan"],
    "average_gpa": 3.79268
  },
  {
    "department": "MATH",
    "course_number": "858F",
    "title": null,
    "description": null,
    "credits": null,
    "professors": ["John Benedetto"],
    "average_gpa": 3.64
  },
  {
    "department": "MATH",
    "course_number": "858G",
    "title": "Selected Topics in Analysis; Optimal Transport",
    "description": null,
    "credits": 1,
    "professors": ["Kasso Okoudjou", "Jakob Hultgren"],
    "average_gpa": 4.0
  },
  {
    "department": "MATH",
    "course_number": "858L",
    "title": "Selected Topics in Analysis; Mathmatical Methods in Machine Learning",
    "description": null,
    "credits": 1,
    "professors": ["Wojciech Czaja", "Dong Dong"],
    "average_gpa": 3.61905
  },
  {
    "department": "MATH",
    "course_number": "858M",
    "title": "Selected Topics in Analysis; asymptotic Methods",
    "description": null,
    "credits": 1,
    "professors": ["Dionisios Margetis"],
    "average_gpa": 3.352
  },
  {
    "department": "MATH",
    "course_number": "858N",
    "title": "Selected Topics in Analysis",
    "description": null,
    "credits": 1,
    "professors": ["Jacobo Pejsachowicz", "Patrick Fitzpatrick"],
    "average_gpa": 4.0
  },
  {
    "department": "MATH",
    "course_number": "858P",
    "title": "Selected Topics in Analysis; Harmonic Analysis Methods for Random and Low-Rank Matrices",
    "description": null,
    "credits": 1,
    "professors": ["Radu Balan"],
    "average_gpa": 4.0
  },
  {
    "department": "MATH",
    "course_number": "858Q",
    "title": null,
    "description": null,
    "credits": null,
    "professors": ["John Benedetto"],
    "average_gpa": null
  },
  {
    "department": "MATH",
    "course_number": "858R",
    "title": "Selected Topics in Analysis; Ramsey Theory and its Applications",
    "description": "<i>Cross-listed with CMSC752. Credit only granted for CMSC752, CMSC858R, or MATH858R.</i>",
    "credits": 3,
    "professors": ["Radu Balan", "William Gasarch"],
    "average_gpa": 3.63636
  },
  {
    "department": "MATH",
    "course_number": "858S",
    "title": null,
    "description": null,
    "credits": null,
    "professors": [],
    "average_gpa": null
  },
  {
    "department": "MATH",
    "course_number": "858T",
    "title": "Selected Topics in Analysis; STOCHASTIC METHODS AND APPLICATIONS",
    "description": null,
    "credits": 1,
    "professors": ["Maria Cameron", "Rodrigo Trevino"],
    "average_gpa": 3.77037
  },
  {
    "department": "MATH",
    "course_number": "858W",
    "title": "Selected Topics in Analysis; Frames, Sampling and Wavelets",
    "description": null,
    "credits": 1,
    "professors": ["John Benedetto"],
    "average_gpa": 4.0
  },
  {
    "department": "MATH",
    "course_number": "858Y",
    "title": null,
    "description": null,
    "credits": null,
    "professors": ["Yanir Rubinstein"],
    "average_gpa": 4.0
  },
  {
    "department": "MATH",
    "course_number": "868A",
    "title": "SelectedTopics in Complex Analysis",
    "description": null,
    "credits": 1,
    "professors": [],
    "average_gpa": null
  },
  {
    "department": "MATH",
    "course_number": "868C",
    "title": "SelectedTopics in Complex Analysis; Complex Geometry",
    "description": null,
    "credits": 1,
    "professors": ["Tamas Darvas", "Richard Wentworth"],
    "average_gpa": 3.82609
  },
  {
    "department": "MATH",
    "course_number": "868D",
    "title": "SelectedTopics in Complex Analysis; Pluripotential Theory",
    "description": null,
    "credits": 1,
    "professors": ["Tamas Darvas"],
    "average_gpa": null
  },
  {
    "department": "MATH",
    "course_number": "868F",
    "title": "SelectedTopics in Complex Analysis; Introduction to Teichueller Dynamics",
    "description": null,
    "credits": 1,
    "professors": ["Giovanni Forni"],
    "average_gpa": 4.0
  },
  {
    "department": "MATH",
    "course_number": "868K",
    "title": null,
    "description": null,
    "credits": null,
    "professors": ["Yanir Rubinstein"],
    "average_gpa": 4.0
  },
  {
    "department": "MATH",
    "course_number": "898",
    "title": "Pre-Candidacy Research",
    "description": null,
    "credits": 1,
    "professors": [],
    "average_gpa": null
  },
  {
    "department": "MATH",
    "course_number": "899",
    "title": "Doctoral Dissertation Research",
    "description": null,
    "credits": 6,
    "professors": [],
    "average_gpa": 4.0
  }
]
