[
  {
    "department": "STAT",
    "course_number": "100",
    "title": "Elementary Statistics and Probability",
    "description": "<b>Prerequisite:</b> MATH110, MATH112, MATH113, or MATH115; or permission of CMNS-Mathematics department; or must have math eligibility of STAT100 or higher and math eligibility is based on the Math Placement Exam or the successful completion of Math 003 with appropriate eligibility.\n<b>Restriction:</b> Must not have completed MATH111; or must not have completed any MATH or STAT course with a prerequisite of MATH141.\n<b>Credit only granted for:</b> STAT100, MATH107 or MATH111.\nSimplest tests of statistical hypotheses; applications to before-and-after and matched pair studies. Events, probability, combinations, independence. Binomial probabilities, confidence limits. Random variables, expected values, median, variance. Tests based on ranks. Law of large numbers, normal approximation. Estimates of mean and variance.",
    "credits": 3,
    "professors": [
      "Natalia Tchetcherina",
      "Samuel Punshon-Smith",
      "Judith Law",
      "Lior Hilsenrath",
      "Robert Maschal",
      "Adam Lizzi",
      "Rebecca Black",
      "Casey Cremins",
      "Jacky Chong",
      "Mark Magsino",
      "Xuan Yao",
      "Philip Wertheimer",
      "Joshua Schneider",
      "Micah Goldblum",
      "Christoforos Somarakis",
      "Susan Mazzullo",
      "Stefan Poikonen",
      "Alexey Stepanov",
      "Archana Khurana",
      "Barry Spieler",
      "Kimberly Fouche",
      "Karl Schmitt",
      "Stefan Sabo",
      "Daniel Zollers",
      "Kijoeng Nam",
      "Lemeng Pan",
      "Matthew Whiteway",
      "Ian Johnson",
      "James Murphy",
      "Lucas Tcheuko",
      "Travis Andrews",
      "Susan Chimiak",
      "Andreas Roy",
      "Chen Qian",
      "Ran Ji",
      "Alexander Estes",
      "Domingo Ruiz",
      "Son Ho",
      "Christiana Sabett",
      "Suddhasattwa Das",
      "Douglas Ulrich",
      "Chunting Lu",
      "Kung-Ching Lin",
      "Pratima Hebbar",
      "Jonathan Fernandes",
      "Matthew Griffin",
      "Thien Ngo",
      "Darcy Conant",
      "Matthew Dellatorre",
      "Muhammad Elgebali",
      "Shiping Liu",
      "Yuyin Shi",
      "Valeriia Cherepanova",
      "Siddharth Sharma"
    ],
    "average_gpa": 2.73241
  },
  {
    "department": "STAT",
    "course_number": "386",
    "title": "Experiential Learning",
    "description": "<b>Prerequisite:</b> Must have learning proposal approved by the CMNS-Mathematics Department.",
    "credits": 3,
    "professors": ["Abram Kagan", "Paul Smith", "Antoine Mellet"],
    "average_gpa": null
  },
  {
    "department": "STAT",
    "course_number": "400",
    "title": "Applied Probability and Statistics I",
    "description": "<b>Prerequisite:</b> 1 course with a minimum grade of C- from (MATH131, MATH141); or students who have taken courses with comparable content may contact the department.\n<b>Credit only granted for:</b> BMGT231, ENEE324, or STAT400.\n<b>Additional information:</b> Not acceptable toward graduate degrees in MATH/STAT/AMSC.\nRandom variables, standard distributions, moments, law of large numbers and central limit theorem. Sampling methods, estimation of parameters, testing of hypotheses.",
    "credits": 3,
    "professors": [
      "John Millson",
      "Timothy Pilachowski",
      "Sandra Cerrai",
      "Dmitry Dolgopyat",
      "Justin Wyss-Gallifent",
      "Natalia Tchetcherina",
      "Susan Mazzullo",
      "Joan Ren",
      "Casey Cremins",
      "Terence Long",
      "Archana Khurana",
      "Hatice Sahinoglu",
      "Chiao-Wen Hsiao",
      "Susan Chimiak",
      "Bradford Sanders",
      "Sahil Chopra",
      "Peter Nandori",
      "Lijuan Cao",
      "Yuanhang Wang",
      "Yiming Lyu",
      "Guangyu Xi",
      "Scott Preston",
      "Jonathan Fernandes",
      "Paul Smith",
      "Tong Lu",
      "Mestiyage Gunatilleka",
      "Raymond Schram"
    ],
    "average_gpa": 2.79978
  },
  {
    "department": "STAT",
    "course_number": "401",
    "title": "Applied Probability and Statistics II",
    "description": "<b>Prerequisite:</b> 1 course with a minimum grade of C- from (STAT400, STAT410).\n<b>Additional information:</b> Not acceptable toward graduate degrees in MATH/STAT/AMSC.\nPoint estimation - unbiased and consistent estimators. Interval estimation. Minimum variance and maximum likelihood estimators. Testing of hypotheses. Regression, correlation and analysis of variance. Sampling distributions. Elements of non-parametric methods.",
    "credits": 3,
    "professors": [
      "Casey Cremins",
      "Joan Ren",
      "Yuan Liao",
      "Natalia Tchetcherina",
      "Frances Gulick",
      "Michael Jakobson",
      "Timothy Pilachowski",
      "Peter Nandori",
      "Takumi Saegusa",
      "Guan Huang",
      "Susan Mazzullo",
      "Tingni Sun",
      "Archana Khurana",
      "Hilaf Hasson",
      "Hatice Sahinoglu",
      "Zhenqiu Liu",
      "Chiao-Wen Hsiao",
      "Susan Chimiak",
      "Paul Smith",
      "Adam Telatovich",
      "Judith Law",
      "Guangyu Xi",
      "Abram Kagan",
      "Jonathan Fernandes",
      "Shiping Liu",
      "Mestiyage Gunatilleka",
      "Scott Preston"
    ],
    "average_gpa": 2.95735
  },
  {
    "department": "STAT",
    "course_number": "410",
    "title": "Introduction to Probability Theory",
    "description": "<b>Prerequisite:</b> 1 course with a minimum grade of C- from (MATH240, MATH461, MATH341); and 1 course with a minimum grade of C- from (MATH340, MATH241).  Cross-listed with SURV410.  Credit only granted  for: STAT410 or SURV410.\nProbability and its properties. Random variables and distribution functions in one and several dimensions. Moments. Characteristic functions. Limit theorems.",
    "credits": 3,
    "professors": [
      "Leonid Koralov",
      "Dmitry Dolgopyat",
      "Sandra Cerrai",
      "Jian Lun Xu",
      "Christian Zickert",
      "Abram Kagan",
      "Michael Laskowski",
      "Melissa Macasieb",
      "Steven Chadwick",
      "Mark Freidlin",
      "Qiaoling Wei",
      "Doron Levy",
      "Swarnava Mukhopadhyay",
      "Peter Nandori",
      "Maria Cameron",
      "Jonathan Rosenberg",
      "Grace Yang",
      "Archana Khurana",
      "Vadim Kaloshin",
      "Casey Cremins",
      "Alex Blumenthal",
      "Brian Smithling",
      "Eric Slud",
      "Scott Preston",
      "Guangyu Xi",
      "Jonathan Fernandes",
      "Jacob Bedrossian",
      "Hatice Sahinoglu",
      "Natalia Tchetcherina",
      "Mestiyage Gunatilleka",
      "Joan Ren",
      "Christian Rosendal",
      "Lutian Zhao"
    ],
    "average_gpa": 2.55585
  },
  {
    "department": "STAT",
    "course_number": "420",
    "title": "Theory and Methods of Statistics",
    "description": "<b>Prerequisite:</b> 1 course with a minimum grade of C- from (SURV410, STAT410).  Cross-listed with SURV420.\n<b>Credit only granted for:</b> STAT420  or SURV420.\nPoint estimation, sufficiency, completeness, Cramer-Rao inequality, maximum likelihood. Confidence intervals for parameters of normal distribution. Hypothesis testing, most powerful tests, likelihood ratio tests. Chi-square tests, analysis of variance, regression, correlation. Nonparametric methods.",
    "credits": 3,
    "professors": [
      "Jian Lun Xu",
      "Joan Ren",
      "Tingni Sun",
      "Abram Kagan",
      "Takumi Saegusa",
      "Adam Telatovich",
      "Dong Dong",
      "Paul Smith"
    ],
    "average_gpa": 2.53401
  },
  {
    "department": "STAT",
    "course_number": "426",
    "title": "Introduction to Data Science and Machine Learning",
    "description": "<b>Prerequisite:</b> Minimum grade of C- in MATH241 or MATH340; and minimum grade of C- in MATH240,  MATH461 or MATH341;  and minimum grade of C- in STAT400 or STAT410;  students who have taken courses with content comparable to STAT400/410 may request permission of the instructor.\n<b>Credit only granted for:</b> STAT426 or CMSC320.\nAn introductory course to the recent developments in the fields of data science and machine learning. Emphasis will be given to mathematical and statistical understanding of commonly used methods and processes.",
    "credits": 3,
    "professors": [
      "Wojciech Czaja",
      "Benjamin Kedem",
      "Vincent Lyzinski",
      "Scott Preston"
    ],
    "average_gpa": 2.62857
  },
  {
    "department": "STAT",
    "course_number": "430",
    "title": "Introduction to Statistical Computing with SAS",
    "description": "<b>Prerequisite:</b> 1 course with a minimum grade of C- from (STAT400, STAT410).\nDescriptive and inferential statistics. SAS software: numerical and graphical data summaries; merging, sorting and splitting data sets. Least squares, regression, graphics and informal diagnostics, interpreting results.  Categorical data, lifetime data, time series. Applications to engineering, life science, business and social science.",
    "credits": 3,
    "professors": [
      "Benjamin Kedem",
      "Xia Li",
      "Susan Mazzullo",
      "Timothy Pilachowski",
      "Tingni Sun",
      "Alexey Stepanov",
      "Christine Nickel",
      "David Shaw",
      "Susan Chimiak",
      "Chiao-Wen Hsiao",
      "Corry Bedwell",
      "Bradford Sanders",
      "Emily Francis",
      "Natalia Tchetcherina",
      "Hatice Sahinoglu",
      "Nicholas Paskal",
      "Ayushi Saxena",
      "Gustavo Varela Alvarenga"
    ],
    "average_gpa": 3.24788
  },
  {
    "department": "STAT",
    "course_number": "440",
    "title": "Sampling Theory",
    "description": "<b>Prerequisite:</b> 1 course with a minimum grade of C- from (STAT401, STAT420).\n<b>Credit only granted for:</b> STAT440 or SURV440.\nSimple random sampling. Sampling for proportions. Estimation of sample size. Sampling with varying probabilities. Sampling: stratified, systematic, cluster, double, sequential, incomplete.",
    "credits": 3,
    "professors": [
      "Natalia Tchetcherina",
      "James Lepkowski",
      "Yuan Liao",
      "Susan Mazzullo",
      "Susan Chimiak",
      "Daniel Bonnéry",
      "Partha Lahiri",
      "Paul Smith"
    ],
    "average_gpa": 3.354
  },
  {
    "department": "STAT",
    "course_number": "464",
    "title": "Introduction to Biostatistics",
    "description": "<b>Prerequisite:</b> Must have completed one semester of calculus.\n<b>Restriction:</b> Junior standing or higher.\n<b>Credit only granted for:</b> BIOE372 or STAT464.\n<b>Additional information:</b> Not acceptable toward degrees in MATH/STAT.\nProbabilistic models. Sampling. Some applications of probability in genetics. Experimental designs. Estimation of effects of treatments. Comparative experiments. Fisher-Irwin test. Wilcoxon tests for paired comparisons.",
    "credits": 3,
    "professors": [
      "Casey Cremins",
      "Raluca Rosca",
      "Bradford Sanders",
      "Terence Long",
      "Chiao-Wen Hsiao",
      "Hatice Sahinoglu",
      "Matthew Griffin",
      "Archana Khurana"
    ],
    "average_gpa": 3.12745
  },
  {
    "department": "STAT",
    "course_number": "470",
    "title": "Actuarial Mathematics",
    "description": "<b>Prerequisite:</b> 1 course with a minimum grade of C- from (MATH240, MATH461, MATH341); and 1 course with a minimum grade of C- from (MATH340, MATH241).\n<b>Recommended:</b> STAT400.\nMajor mathematical ideas involved in calculation of life insurance premiums, including compound interest and present valuation of future income streams; probability distribution and expected values derived from life tables; the interpolation of probability distributions from values estimated at one-year multiples; the 'Law of Large Numbers' describing the regular probabilistic behavior of large populations of independent individuals; and the detailed calculation of expected present values arising in insurance problems.",
    "credits": 3,
    "professors": [
      "Natalia Tchetcherina",
      "Steven Chadwick",
      "Susan Mazzullo",
      "Harland Glaz",
      "Matthew Griffin"
    ],
    "average_gpa": 3.32103
  },
  {
    "department": "STAT",
    "course_number": "498",
    "title": "Selected Topics in Statistics",
    "description": null,
    "credits": 1,
    "professors": ["Peter Nandori"],
    "average_gpa": null
  },
  {
    "department": "STAT",
    "course_number": "498A",
    "title": "Selected Topics in Statistics",
    "description": null,
    "credits": 1,
    "professors": [],
    "average_gpa": null
  },
  {
    "department": "STAT",
    "course_number": "600",
    "title": "Probability Theory I",
    "description": "<b>Prerequisite:</b> STAT410.\nProbability space; distribution functions and densities; Poissson limit theoreom; de Moivre-Laplace theorem; measure-theoretic definition of expectation; classification of measures on R; convergence of random variables; Radon-Nikodym theorem;LP spaces; conditional probabilities; independence of events, sigma-algebras and random variables; Bayes' theo rem; pi-systems and Dynkin systems; discrete Markov chains; random walks; gambler's ruin problem; Markov chains on a general phase space; Borel-cantelli lemmas; Kolmogorov inequality; three series theorem; laws of large numbers.",
    "credits": 3,
    "professors": [
      "Leonid Koralov",
      "Mark Freidlin",
      "Sandra Cerrai",
      "Dmitry Dolgopyat"
    ],
    "average_gpa": 3.37394
  },
  {
    "department": "STAT",
    "course_number": "601",
    "title": "Probability Theory II",
    "description": "<b>Prerequisite:</b> STAT600.\nWeak convergence of measures; characteristic functions; Central Limit Theorem and local limit theorem; stable laws; Kolmogorov consistency theorem (without proof); conditional expectations and martingales; optimal stopping theorem; convergence of martingales; Brownian motion; Markov processes and families; stochastic integral and Ito formula.\n<i>Offered Spring only.</i>",
    "credits": 3,
    "professors": ["Sandra Cerrai", "Leonid Koralov", "Mark Freidlin"],
    "average_gpa": 3.37759
  },
  {
    "department": "STAT",
    "course_number": "650",
    "title": "Applied Stochastic Processes",
    "description": "<b>Prerequisite:</b> STAT410; or students who have taken courses with comparable content may contact the department.\nBasic concepts of stochastic processes. Markov processes (discrete and continuous parameters), Random walks, Poisson processes, Birth and death processes. Renewal processes and basic limit theorems. Discrete time martingales, stopping times, optional sampling theorem. Applications from theories of stochastic epidemics, survival analysis and others.",
    "credits": 3,
    "professors": [
      "Abram Kagan",
      "Dmitry Dolgopyat",
      "Eric Slud",
      "Grace Yang",
      "Mark Freidlin",
      "Vincent Lyzinski"
    ],
    "average_gpa": 3.30409
  },
  {
    "department": "STAT",
    "course_number": "689",
    "title": "Research Interactions in Statistics",
    "description": null,
    "credits": 1,
    "professors": ["Yuan Liao", "Paul Smith"],
    "average_gpa": 4.0
  },
  {
    "department": "STAT",
    "course_number": "698A",
    "title": "Selected Topics in Probability",
    "description": null,
    "credits": 1,
    "professors": [],
    "average_gpa": null
  },
  {
    "department": "STAT",
    "course_number": "700",
    "title": "Mathematical Statistics I",
    "description": "<b>Prerequisite:</b> STAT410; or students who have taken courses with comparable content may contact the department.\nSampling distributions including noncentral chi-squared, t, F. Exponential families, completeness. Sufficiency, factorization, likelihood ratio. Decision theory, Bayesian methods, minimax principle. Point estimation. Lehmann-Scheffe and Cramer-Rao theorems. Set estimation.\n<i>Offered fall only.</i>",
    "credits": 3,
    "professors": ["Abram Kagan", "Eric Slud", "Benjamin Kedem", "Joan Ren"],
    "average_gpa": 3.19427
  },
  {
    "department": "STAT",
    "course_number": "701",
    "title": "Mathematical Statistics II",
    "description": "<b>Prerequisite:</b> STAT700; or students who have taken courses with comparable content may contact the department.\nTesting hypotheses: parametric methods. Neyman-Pearson lemma. Uniformly most powerful tests. Unbiased tests. Locally optimal tests. Large sample theory, asymptotically best procedures. Nonparametric methods, Wilcoxon, Fisher-Yates, median tests. Linear models, analysis of variance, regression and correlation. Sequential analysis.\n<i>Offered Spring only.</i>",
    "credits": 3,
    "professors": ["Abram Kagan", "Eric Slud", "Benjamin Kedem", "Joan Ren"],
    "average_gpa": 3.62277
  },
  {
    "department": "STAT",
    "course_number": "702",
    "title": "Survival Analysis",
    "description": "<b>Prerequisite:</b> STAT410 and STAT420; or students who have taken courses with comparable content may contact the department; or permission of instructor.\nConcepts/definitions of survival functions, hazard rate or hazard function, cumulative hazard functions, mean residual life, inversion formulas; Parametric models: exponential distribution, Weibull distribution; Censored/incomplete data and real data examples; right censored data, doubly censored data, interval censored data, truncated data; Nonparametric maximal likelihood estimator for the lifetime distribution under different types of censoring (e.g., Kaplan-Meier estimator), self-consistency estimators, the EM algorithm, applications of the empirical likelihood; Semiparametric models: accelerated lifetime model, proportional hazard model, the Cox model; Goodness of fit tests and diagnostic methods for model checking.",
    "credits": 3,
    "professors": ["Joan Ren", "Takumi Saegusa", "Eric Slud"],
    "average_gpa": 3.56857
  },
  {
    "department": "STAT",
    "course_number": "705",
    "title": "Computational Statistics",
    "description": "<b>Prerequisite:</b> STAT700 or STAT420.\n<b>Recommended:</b> Have some programming experience (any language).\n<b>Credit only granted for:</b> STAT705 or STAT798C.\n<b>Formerly:</b> STAT798C.\nModern methods of computational statistics and their application to both practical problems and research. S-Plus and SAS programming with emphasis on S-Plus. S-Plus objects and functions, and SAS procedures. Topics include data management and graphics, Monte Carlo and simulation, bootstrapping, numerical optimization in statistics, linear and generalized linear models, nonparametric regression, time series analysis.",
    "credits": 3,
    "professors": [
      "Benjamin Kedem",
      "Eric Slud",
      "Vincent Lyzinski",
      "Takumi Saegusa"
    ],
    "average_gpa": 3.63897
  },
  {
    "department": "STAT",
    "course_number": "730",
    "title": "Time Series Analysis",
    "description": "<b>Prerequisite:</b> STAT700; and must have completed a graduate course in analysis. Or permission of instructor.\n<b>Recommended:</b> STAT701 and STAT650.\nThe methodology of probabilistic description and statistical analysis of (primarily stationary) random sequences and processes. Correlation functions, Gaussian processes, Hilbert-space methods including Wold decomposition and spectral representation, periodogram and estimation of spectral densities, parameter estimation and model identification for ARMA processes, linear filtering, Kalman-Bucy filtering, sampling theorems for continuous-time series, multivariate time series.",
    "credits": 3,
    "professors": ["Benjamin Kedem", "Eric Slud"],
    "average_gpa": 3.60789
  },
  {
    "department": "STAT",
    "course_number": "740",
    "title": "Linear Statistical Models I",
    "description": "<b>Prerequisite:</b> STAT700 or STAT420.\nLeast squares, general linear models, estimability and Gauss-Markov theorem. Simple and multiple linear regression, analysis of residuals and diagnostics, polynomial models, variable selection. Qualitative predictors, one and two way analysis of variance, multiple comparisons, analysis of covariance. Nonlinear least squares. High-level statistical computer software will be used for data analysis throughout the course.",
    "credits": 3,
    "professors": ["Paul Smith"],
    "average_gpa": 3.26905
  },
  {
    "department": "STAT",
    "course_number": "741",
    "title": "Linear Statistical Models II",
    "description": "<b>Prerequisite:</b> STAT740.\nContinuation of STAT 740. Multiway layouts, incomplete designs, Latin squares, complete and fractional factorial designs, crossed and nested models. Balanced random effects models, mixed models, repeated measures.General mixed model, computational algorithms, ML and REML estimates. Generalized linear models, logistic and loglinear regression.\n<i>Offered Spring only.</i>",
    "credits": 3,
    "professors": ["Paul Smith"],
    "average_gpa": 3.56154
  },
  {
    "department": "STAT",
    "course_number": "750",
    "title": "Multivariate Analysis",
    "description": "<b>Prerequisite:</b> STAT700 or STAT420.\nMultivariate normal, Wishart's and Hotelling's distributions. Tests of hypotheses, estimation. Generalized distance, discriminant analysis. Regression and correlation. Multivariate analysis of variance; distribution of test criteria. Principal components, canonical correlations and factor analysis.",
    "credits": 3,
    "professors": [
      "Joan Ren",
      "Abram Kagan",
      "Yuan Liao",
      "Benjamin Kedem",
      "Eric Slud"
    ],
    "average_gpa": 3.75
  },
  {
    "department": "STAT",
    "course_number": "770",
    "title": "Analysis of Categorical Data",
    "description": "<b>Prerequisite:</b> STAT430 and STAT420; or permission of CMNS-Mathematics department.\nLoglinear and logistic models. Single classification, two-way classification; contingency tables; tests of homogeneity and independence models, measures of association, distribution theory. Bayesian methods. Incomplete contingency tables. Square contingency tables - symmetry. Extensions to higher dimensional contingency tables.",
    "credits": 3,
    "professors": ["Joan Ren", "Eric Slud"],
    "average_gpa": 3.55758
  },
  {
    "department": "STAT",
    "course_number": "798A",
    "title": "Selected Topics in Statistics",
    "description": null,
    "credits": 1,
    "professors": [],
    "average_gpa": null
  },
  {
    "department": "STAT",
    "course_number": "798B",
    "title": null,
    "description": null,
    "credits": null,
    "professors": ["Partha Lahiri"],
    "average_gpa": null
  },
  {
    "department": "STAT",
    "course_number": "798E",
    "title": null,
    "description": null,
    "credits": null,
    "professors": ["Mark Freidlin"],
    "average_gpa": 3.95
  },
  {
    "department": "STAT",
    "course_number": "798F",
    "title": null,
    "description": null,
    "credits": null,
    "professors": ["Mark Freidlin"],
    "average_gpa": 3.94
  },
  {
    "department": "STAT",
    "course_number": "798R",
    "title": null,
    "description": null,
    "credits": null,
    "professors": ["Joan Ren"],
    "average_gpa": null
  },
  {
    "department": "STAT",
    "course_number": "798Y",
    "title": null,
    "description": null,
    "credits": null,
    "professors": ["Grace Yang"],
    "average_gpa": null
  },
  {
    "department": "STAT",
    "course_number": "799",
    "title": "Master's Thesis Research",
    "description": null,
    "credits": 1,
    "professors": [],
    "average_gpa": null
  },
  {
    "department": "STAT",
    "course_number": "808A",
    "title": "Selected Topics in Probability",
    "description": null,
    "credits": 1,
    "professors": [],
    "average_gpa": null
  },
  {
    "department": "STAT",
    "course_number": "818A",
    "title": "Selected Topics in Statistics",
    "description": null,
    "credits": 1,
    "professors": [],
    "average_gpa": null
  },
  {
    "department": "STAT",
    "course_number": "818B",
    "title": "Selected Topics in Statistics; Bayesian Statistical Analysis",
    "description": null,
    "credits": 3,
    "professors": ["Sandra Cerrai", "Partha Lahiri"],
    "average_gpa": 3.9
  },
  {
    "department": "STAT",
    "course_number": "818C",
    "title": null,
    "description": null,
    "credits": null,
    "professors": ["Mark Freidlin"],
    "average_gpa": 2.925
  },
  {
    "department": "STAT",
    "course_number": "818D",
    "title": "Selected Topics in Statistics; BOOTSTRAP METHODS",
    "description": null,
    "credits": 1,
    "professors": ["Mark Freidlin", "Eric Slud"],
    "average_gpa": 3.87143
  },
  {
    "department": "STAT",
    "course_number": "818E",
    "title": "Selected Topics in Statistics; Stochastic dynamics",
    "description": null,
    "credits": 1,
    "professors": ["Mark Freidlin", "Yu Gu"],
    "average_gpa": 3.34286
  },
  {
    "department": "STAT",
    "course_number": "818F",
    "title": "Selected Topics in Statistics; HIGH DEMINSIONAL DATA",
    "description": null,
    "credits": 1,
    "professors": ["Takumi Saegusa"],
    "average_gpa": 4.0
  },
  {
    "department": "STAT",
    "course_number": "818G",
    "title": "Selected Topics in Statistics; High Dimensional Data",
    "description": null,
    "credits": 1,
    "professors": ["Tingni Sun"],
    "average_gpa": 3.91429
  },
  {
    "department": "STAT",
    "course_number": "818H",
    "title": "Selected Topics in Statistics; Selected Topics in Complex Analysis",
    "description": null,
    "credits": 1,
    "professors": [],
    "average_gpa": null
  },
  {
    "department": "STAT",
    "course_number": "818J",
    "title": null,
    "description": null,
    "credits": null,
    "professors": ["Sandra Cerrai"],
    "average_gpa": 3.4625
  },
  {
    "department": "STAT",
    "course_number": "818L",
    "title": null,
    "description": null,
    "credits": null,
    "professors": ["Joan Ren"],
    "average_gpa": 3.0
  },
  {
    "department": "STAT",
    "course_number": "818M",
    "title": "Selected Topics in Statistics; MISSING DATA",
    "description": null,
    "credits": 1,
    "professors": ["Partha Lahiri", "Eric Slud"],
    "average_gpa": 3.73636
  },
  {
    "department": "STAT",
    "course_number": "818N",
    "title": "Selected Topics in Statistics; Nonparametric Regression",
    "description": null,
    "credits": 1,
    "professors": ["Takumi Saegusa"],
    "average_gpa": 4.0
  },
  {
    "department": "STAT",
    "course_number": "818R",
    "title": null,
    "description": null,
    "credits": null,
    "professors": [],
    "average_gpa": null
  },
  {
    "department": "STAT",
    "course_number": "818S",
    "title": "Selected Topics in Statistics; Stochastic Differential Equations",
    "description": null,
    "credits": 1,
    "professors": ["Mark Freidlin"],
    "average_gpa": 2.38571
  },
  {
    "department": "STAT",
    "course_number": "818X",
    "title": null,
    "description": null,
    "credits": null,
    "professors": ["Partha Lahiri", "Daniel Bonnéry"],
    "average_gpa": null
  },
  {
    "department": "STAT",
    "course_number": "818Z",
    "title": null,
    "description": null,
    "credits": null,
    "professors": ["Partha Lahiri"],
    "average_gpa": null
  },
  {
    "department": "STAT",
    "course_number": "898",
    "title": "Pre-Candidacy Research",
    "description": null,
    "credits": 1,
    "professors": [],
    "average_gpa": null
  },
  {
    "department": "STAT",
    "course_number": "899",
    "title": "Doctoral Dissertation Research",
    "description": null,
    "credits": 6,
    "professors": [],
    "average_gpa": null
  }
]
